{
  "metas": [
    {
      "id": "tmdb:1601195",
      "type": "movie",
      "name": "Dave Chappelle: The Unstoppable...",
      "description": "Facing a world gone sideways, comedy icon Dave Chappelle delivers bold truths and potent punchlines in this no-holds-barred special.",
      "poster": "https://image.tmdb.org/t/p/w500/534y0Pt72VEAUTV3THKpMxzCoB3.jpg",
      "releaseInfo": "2025-12-19"
    },
    {
      "id": "tmdb:1497017",
      "type": "movie",
      "name": "Adult Swim's The Elephant",
      "description": "Crafted in three parts by four animation superstars, Adult Swim's The Elephant brings to life a very human journey of self-discovery in varied styles.",
      "poster": "https://image.tmdb.org/t/p/w500/vq50QGdUSAiUNC2f0BDdgyhUQGg.jpg",
      "releaseInfo": "2025-12-19"
    },
    {
      "id": "tmdb:1584125",
      "type": "movie",
      "name": "Breakdown: 1975",
      "description": "In 1975, as America faced social and political upheaval, filmmakers turned chaos into art.",
      "poster": "https://image.tmdb.org/t/p/w500/6LirpQnBmBpAOa5Me1lBCBBy90e.jpg",
      "releaseInfo": "2025-12-19"
    },
    {
      "id": "tmdb:1584619",
      "type": "movie",
      "name": "Murder in Monaco",
      "description": "Monaco, 1999. One of the world's richest men dies in his penthouse. This documentary unpacks the mysterious murder of billionaire banker, Edmond Safra.",
      "poster": "https://image.tmdb.org/t/p/w500/hW93OYJnnHwGaGa4S2mNxlEhgsF.jpg",
      "releaseInfo": "2025-12-17"
    },
    {
      "id": "tmdb:1549234",
      "type": "movie",
      "name": "A Royal Christmas Tail",
      "description": "When a dashing prince trades a glass slipper for a dog tag, he embarks on a heartwarming Christmas quest to find the mysterious woman — and her adorable pup — who captured his heart in one magical holiday moment.",
      "poster": "https://image.tmdb.org/t/p/w500/9EEcVxBYL9l1OkwjiFRhMvxQJzA.jpg",
      "releaseInfo": "2025-12-14"
    },
    {
      "id": "tmdb:1234731",
      "type": "movie",
      "name": "Anaconda",
      "description": "A group of friends facing mid-life crises head to the rainforest with the intention of remaking their favorite movie from their youth, only to find themselves in a fight for their lives against natural disasters, giant snakes and violent criminals.",
      "poster": "https://image.tmdb.org/t/p/w500/5MDnvvkOqthhE5gQebzkcOhD1p5.jpg",
      "releaseInfo": "2025-12-13"
    },
    {
      "id": "tmdb:1567893",
      "type": "movie",
      "name": "Sarah Squirm: Live + in the Flesh",
      "description": "After four seasons (and counting) on Saturday Night Live, Sarah Sherman's unholy alter ego, Sarah Squirm, slithers onto your screen and rips off the straitjacket, unleashing a festering and hilarious hour of bodily fluids, open-wound confessionals, and jokes that will leave scars on your soul.",
      "poster": "https://image.tmdb.org/t/p/w500/73wbpsAR1OK0faQCNXYHA37rAld.jpg",
      "releaseInfo": "2025-12-12"
    },
    {
      "id": "tmdb:1435092",
      "type": "movie",
      "name": "Goodbye June",
      "description": "Four siblings' lives change drastically when their ailing mother takes a turn for the worse over the holiday season.",
      "poster": "https://image.tmdb.org/t/p/w500/ygsMOnttVCekvJZgvmnvaemxPHA.jpg",
      "releaseInfo": "2025-12-12"
    },
    {
      "id": "tmdb:1562010",
      "type": "movie",
      "name": "Taylor Swift | The Eras Tour | The Final Show",
      "description": "Filmed at the end of the tour in Vancouver, B.C., with the entire Tortured Poets Department set.",
      "poster": "https://image.tmdb.org/t/p/w500/c11km7kLK2F30fTNHP5Si9m8foG.jpg",
      "releaseInfo": "2025-12-12"
    },
    {
      "id": "tmdb:1401778",
      "type": "movie",
      "name": "Turbulence",
      "description": "Young married couple Zach and Emmy decide to take a hot air balloon trip across the Italian Dolomites to rekindle their relationship. When they and pilot Harry are joined by a third passenger, Julia, events unfold in ways they could never imagine five thousand meters in the air.",
      "poster": "https://image.tmdb.org/t/p/w500/jRuiKL4S9UpLma2ZlM47xIu2gbe.jpg",
      "releaseInfo": "2025-12-12"
    },
    {
      "id": "tmdb:1476740",
      "type": "movie",
      "name": "Influencers",
      "description": "In the picturesque landscapes of Southern France, a young woman's chilling fascination with murder and identity theft sends her life into a whirlwind of chaos.",
      "poster": "https://image.tmdb.org/t/p/w500/nRdjGDxBW60OhzjAtikLgQBwt3B.jpg",
      "releaseInfo": "2025-12-12"
    },
    {
      "id": "tmdb:1255775",
      "type": "movie",
      "name": "Merv",
      "description": "When their beloved dog Merv loses his spark after their split, Anna and Russ are forced into the world's most awkward co-parenting arrangement. Hoping to shake Merv out of his funk, Russ takes him to Florida for a much-needed getaway-only for Anna to show up unexpectedly. As Merv slowly gets his groove back, turns out fixing their dog's broken heart may lead to a few sparks of their own.",
      "poster": "https://image.tmdb.org/t/p/w500/nfGlYjINEcGtxV46viW4olwHHSz.jpg",
      "releaseInfo": "2025-12-10"
    },
    {
      "id": "tmdb:1206008",
      "type": "movie",
      "name": "Ella McCay",
      "description": "An idealistic young politician juggles familial issues and a challenging work life while preparing to take over the job of her mentor, the state’s longtime incumbent governor.",
      "poster": "https://image.tmdb.org/t/p/w500/iQCtK477yqp6xnHHrQG2P0lXoow.jpg",
      "releaseInfo": "2025-12-09"
    },
    {
      "id": "tmdb:1585476",
      "type": "movie",
      "name": "Kevin Costner Presents: The First Christmas",
      "description": "Kevin Costner hosts this special exploring the extraordinary journey of Mary and Joseph as they navigate the hardships, trials and triumphs surrounding Jesus Christ's birth, offering an inspiring way to experience the true meaning of Christmas.",
      "poster": "https://image.tmdb.org/t/p/w500/yXPmDhPj26JqEekHIruDtENSrsj.jpg",
      "releaseInfo": "2025-12-09"
    },
    {
      "id": "tmdb:1586820",
      "type": "movie",
      "name": "Elmo and Mark Rober's Merry Giftmas",
      "description": "Elmo and his Sesame Street friends work with former NASA engineer turned YouTube star Mark Rober to make special presents for a Merry Giftmas exchange.",
      "poster": "https://image.tmdb.org/t/p/w500/gcFxbtsgyMMripGtUIxPmmFxQXT.jpg",
      "releaseInfo": "2025-12-08"
    },
    {
      "id": "tmdb:1516208",
      "type": "movie",
      "name": "She's Making a List",
      "description": "Naughty or Nice inspector Isabel Haynes doesn’t anticipate anything out of the ordinary when she’s assigned to evaluate 11-year-old Charlie Duncan. However, soon, Isabel falls for Charlie’s widowed father Jason, which makes her question the rigid rules of her job. As Christmas approaches, Isabel must choose between following the holiday algorithm or following her heart.",
      "poster": "https://image.tmdb.org/t/p/w500/lqhCnRPb3pTXF1G4uNTQEsW5XUg.jpg",
      "releaseInfo": "2025-12-06"
    },
    {
      "id": "tmdb:1572017",
      "type": "movie",
      "name": "Love and Wine",
      "description": "A privileged young man working at his wealthy father's business traps himself in a lie when he falls in love with a hard-working medical student, and tries to convince her that he comes from more humble beginnings like hers. What follows is a comedic whirlwind of chaos and heartfelt revelations.",
      "poster": "https://image.tmdb.org/t/p/w500/aRJrEffxIoplzUwzVsWvFDTQgvK.jpg",
      "releaseInfo": "2025-12-05"
    },
    {
      "id": "tmdb:1392796",
      "type": "movie",
      "name": "Diary of a Wimpy Kid: The Last Straw",
      "description": "When laidback Greg finds himself at odds with his dad's outsized expectations, pressure builds to turn his act around. After a series of hilarious near disasters, Greg's dad presents him with an ultimatum that just might challenge his wimpy ways for good.",
      "poster": "https://image.tmdb.org/t/p/w500/emcCjpC289NxAGuVwlItHCTrgT7.jpg",
      "releaseInfo": "2025-12-05"
    },
    {
      "id": "tmdb:1199193",
      "type": "movie",
      "name": "Pose",
      "description": "A couple of artists arrive at a manor once frequented by royalty with a perfect plan. He is taking the trendy pictures for her new, chic pop album. It seems to be an ideal weekend, but then more people arrive at the mansion, and the game begins – a psychological game, for example.",
      "poster": "https://image.tmdb.org/t/p/w500/qhyyyWrHUbl6QG4udAJj17CBa5.jpg",
      "releaseInfo": "2025-12-05"
    },
    {
      "id": "tmdb:1566269",
      "type": "movie",
      "name": "The First Snow of Fraggle Rock",
      "description": "When the holidays are filled with unexpected adventures and challenges, the Fraggles learn to appreciate each day for being unique and special, like a snowflake.",
      "poster": "https://image.tmdb.org/t/p/w500/xyxAOTToALUkeFS9x5V6MOv8YWr.jpg",
      "releaseInfo": "2025-12-04"
    },
    {
      "id": "tmdb:1387382",
      "type": "movie",
      "name": "Hunting Season",
      "description": "When a reclusive survivalist and his daughter rescue a mysterious, wounded woman from a river, they become entangled in a deadly web of violence and revenge, forcing them to confront a brutal criminal to survive.",
      "poster": "https://image.tmdb.org/t/p/w500/cbryTyaWdqrKpQCw6K7zm2jrB5v.jpg",
      "releaseInfo": "2025-12-03"
    },
    {
      "id": "tmdb:1261825",
      "type": "movie",
      "name": "Oh. What. Fun.",
      "description": "Claire Clauster is the glue that holds her chaotic, lovable family together at the holidays. But this year, after planning a special outing for them, they make a crucial mistake and leave her home alone. Fed up and feeling under appreciated, she sets off on an impromptu adventure of her own. As her family scrambles to find her, Claire discovers the unexpected magic of a Christmas gone off-script.",
      "poster": "https://image.tmdb.org/t/p/w500/qynCyBKCJUUcj4wo4PE2aQVvote.jpg",
      "releaseInfo": "2025-12-03"
    },
    {
      "id": "tmdb:1578631",
      "type": "movie",
      "name": "With Love, Meghan: Holiday Celebration",
      "description": "'Tis the season! Meghan shares her favorite holiday traditions, seasonal crafts and family recipes with friends old and new in this festive special.",
      "poster": "https://image.tmdb.org/t/p/w500/jHEgYm0zSlqAduZy86Bf9Qg7v7.jpg",
      "releaseInfo": "2025-12-03"
    },
    {
      "id": "tmdb:1441563",
      "type": "movie",
      "name": "My Secret Santa",
      "description": "A single mom needs a job. A ski resort needs a Santa. Disguised as a St. Nick lookalike, can Taylor fool a charming hotel heir into ho-ho-hiring her?",
      "poster": "https://image.tmdb.org/t/p/w500/tpOAzBasKPsKwsUtPZOx1Mzuqq3.jpg",
      "releaseInfo": "2025-12-03"
    },
    {
      "id": "tmdb:1368166",
      "type": "movie",
      "name": "The Housemaid",
      "description": "Trying to escape her past, Millie Calloway accepts a job as a live-in housemaid for the wealthy Nina and Andrew Winchester. But what begins as a dream job quickly unravels into something far more dangerous—a sexy, seductive game of secrets, scandal, and power.",
      "poster": "https://image.tmdb.org/t/p/w500/cWsBscZzwu5brg9YjNkGewRUvJX.jpg",
      "releaseInfo": "2025-12-02"
    },
    {
      "id": "tmdb:1228246",
      "type": "movie",
      "name": "Five Nights at Freddy's 2",
      "description": "One year since the supernatural nightmare at Freddy Fazbear's Pizza, the stories about what transpired there have been twisted into a campy local legend, inspiring the town's first ever Fazfest. With the truth kept from her, Abby sneaks out to reconnect with Freddy, Bonnie, Chica, and Foxy, setting into motion a terrifying series of events that will reveal dark secrets about the real origin of Freddy's, and unleash a decades-hidden horror.",
      "poster": "https://image.tmdb.org/t/p/w500/udAxQEORq2I5wxI97N2TEqdhzBE.jpg",
      "releaseInfo": "2025-12-02"
    },
    {
      "id": "tmdb:1581729",
      "type": "movie",
      "name": "Matt Rife: Unwrapped - A Christmas Crowd Work Special",
      "description": "From gifts gone wrong to family tradition fails, Matt Rife turns an unpredictable audience into an unscripted holiday special.",
      "poster": "https://image.tmdb.org/t/p/w500/dMmT1IWPEJSSLaklHZi7XyrTVyM.jpg",
      "releaseInfo": "2025-12-02"
    },
    {
      "id": "tmdb:1376237",
      "type": "movie",
      "name": "Savage Hunt",
      "description": "A vengeful tracker is brought in to hunt down a large grizzly bear that starts attacking humans once a new Montana resort begins being built.",
      "poster": "https://image.tmdb.org/t/p/w500/iEFIrODvGMUPZormfFTfN0n8siI.jpg",
      "releaseInfo": "2025-12-02"
    },
    {
      "id": "tmdb:83533",
      "type": "movie",
      "name": "Avatar: Fire and Ash",
      "description": "In the wake of the devastating war against the RDA and the loss of their eldest son, Jake Sully and Neytiri face a new threat on Pandora: the Ash People, a violent and power-hungry Na'vi tribe led by the ruthless Varang. Jake's family must fight for their survival and the future of Pandora in a conflict that pushes them to their emotional and physical limits.",
      "poster": "https://image.tmdb.org/t/p/w500/g96wHxU7EnoIFwemb2RgohIXrgW.jpg",
      "releaseInfo": "2025-12-01"
    },
    {
      "id": "tmdb:1175174",
      "type": "movie",
      "name": "Fackham Hall",
      "description": "A new porter embarks on an unlikely relationship with the youngest daughter of a prominent English family. Simultaneously, rivalries are spilling over in the Davenport family, led by the Lord and Lady as they also weather the epic failure of the wedding of their eldest daughter to her caddish cousin.",
      "poster": "https://image.tmdb.org/t/p/w500/fwpdRe6WGmzqXFEJYJVepDQ6jrw.jpg",
      "releaseInfo": "2025-12-01"
    },
    {
      "id": "tmdb:1588237",
      "type": "movie",
      "name": "The Lost Chapter: Yuki's Revenge",
      "description": "Visionary director Quentin Tarantino had a dream of a Kill Bill chapter that never made it to the silver screen, a chapter known as \"Yuki's Revenge.\" Over twenty years later, Tarantino and Epic have come together to bring the story to life in Fortnite.",
      "poster": "https://image.tmdb.org/t/p/w500/dOMsyboGMCVgG3PAidO5EQ9sFKl.jpg",
      "releaseInfo": "2025-11-30"
    },
    {
      "id": "tmdb:1545999",
      "type": "movie",
      "name": "Christmas at the Catnip Café",
      "description": "When a marketing executive learns she’s short on the down payment for her dream condo, she’s informed that her great aunt left her half of a cat café in upstate New York. Hoping to sell it before the holidays, she then meets Dr. Ben Kane, the veterinarian who owns the other half, and has no intention of closing.",
      "poster": "https://image.tmdb.org/t/p/w500/nawRbGneQoEArNT4T3gcY67ewzz.jpg",
      "releaseInfo": "2025-11-30"
    },
    {
      "id": "tmdb:1547921",
      "type": "movie",
      "name": "An Alpine Holiday",
      "description": "Two estranged sisters reunite as their grandmother’s last wish to travel to the French Alps for Christmas to recreate her first trip there with their grandfather. While bonding as sisters, they also make room for romance with between one sister and their French mountaineer guide.",
      "poster": "https://image.tmdb.org/t/p/w500/8XASNGI9cBdlEO2aWGiSd68wbWT.jpg",
      "releaseInfo": "2025-11-29"
    },
    {
      "id": "tmdb:1535221",
      "type": "movie",
      "name": "A Grand Ole Opry Christmas",
      "description": "Gentry Woods, who gave up music after her father's death decades ago, must confront her past when Nashville's Grand Ole Opry invites her to honor her late country star dad at their Christmas celebration.",
      "poster": "https://image.tmdb.org/t/p/w500/y5NqsOFBum7LyX6QHIakwG1plnI.jpg",
      "releaseInfo": "2025-11-29"
    },
    {
      "id": "tmdb:1556834",
      "type": "movie",
      "name": "Lost Horizon",
      "description": "A former soldier, now working for hire, fights to rescue the innocent in a land torn by war. Facing ruthless enemies and betrayal, he struggles for survival, justice, and redemption.",
      "poster": "https://image.tmdb.org/t/p/w500/sBeKHgOtjDRNMHeF9oMR8gpx3k8.jpg",
      "releaseInfo": "2025-11-28"
    },
    {
      "id": "tmdb:1547920",
      "type": "movie",
      "name": "The Snow Must Go On",
      "description": "Nearly a decade after appearing on Broadway, Isaiah visits his family in upstate New York for the holidays and is unexpectedly put back on stage — this time to save his niece’s Christmas show. To make things more complicated, he learns that “an influential Broadway producer’s daughter is in the school production.”",
      "poster": "https://image.tmdb.org/t/p/w500/zixxwy8GbxnqbKdViggwnoR611R.jpg",
      "releaseInfo": "2025-11-28"
    },
    {
      "id": "tmdb:1546001",
      "type": "movie",
      "name": "The More the Merrier",
      "description": "An overwhelmed doctor is left to look after and care for three very pregnant women by herself during a storm on Christmas Eve, until she is joined by an intriguing colleague.",
      "poster": "https://image.tmdb.org/t/p/w500/3wiTWMVT6RpnMkWfW5tW39Ou8ba.jpg",
      "releaseInfo": "2025-11-28"
    },
    {
      "id": "tmdb:1430593",
      "type": "movie",
      "name": "Tinsel Town",
      "description": "A washed-up Hollywood action hero is tricked into starring in a small English town’s chaotic Christmas pantomime, where a straight-talking dance instructor and his estranged daughter just might help him rediscover the magic of the season.",
      "poster": "https://image.tmdb.org/t/p/w500/tGidrBsBBxUkmdQpIeFI09oLL8F.jpg",
      "releaseInfo": "2025-11-28"
    },
    {
      "id": "tmdb:1588671",
      "type": "movie",
      "name": "Louvre Heist: Minute by Minute",
      "description": "Dive into a real-time investigation of the shocking daylight robbery at Paris' Louvre Museum. Former thieves, security staff, eyewitnesses and investigators piece together the crime and ongoing chase to recover France's crown jewels before it's too late.",
      "poster": "https://image.tmdb.org/t/p/w500/fRmX5LRt9OGH879DKnFThO9xUXj.jpg",
      "releaseInfo": "2025-11-27"
    },
    {
      "id": "tmdb:1550797",
      "type": "movie",
      "name": "Prep & Landing: The Snowball Protocol",
      "description": "Christmas elves Lanny and Wayne panic when their holiday missions go awry, leaving Wayne thinking he's in BIG trouble with Santa and accidentally revealing other merry mishaps.",
      "poster": "https://image.tmdb.org/t/p/w500/olbxBEAGaYCgyi2EEecuwa5tuUl.jpg",
      "releaseInfo": "2025-11-27"
    },
    {
      "id": "tmdb:1547918",
      "type": "movie",
      "name": "We Met in December",
      "description": "Two strangers meet on a layover and fall for one another — but forget to exchange numbers. The next day, they fly to Chicago separately, just miss each other, and “embark on separate quests to find one another.\"",
      "poster": "https://image.tmdb.org/t/p/w500/emhOHTwm3HlO1yqkVTl2doprTQh.jpg",
      "releaseInfo": "2025-11-27"
    },
    {
      "id": "tmdb:1499744",
      "type": "movie",
      "name": "A Chuck E. Cheese Christmas",
      "description": "When Chuck E. Cheese and Friends learn that Santa Claus has never experienced a Christmas party, because he is always exhausted from working on Christmas Eve, they set out to throw a surprise Christmas celebration for Santa as a 'thank you' for all the joy he brings to the world! The party also winds up doubling as a way to save their town from the meddling of a holiday-hating evildoer.",
      "poster": "https://image.tmdb.org/t/p/w500/osuxNst45U4d7CT02uYHBI1B9nK.jpg",
      "releaseInfo": "2025-11-27"
    },
    {
      "id": "tmdb:1429520",
      "type": "movie",
      "name": "Sidelined 2: Intercepted",
      "description": "Freshman star quarterback Drayton struggles with the weight of expectations after a devastating setback, while dancer Dallas begins to question the future she thought she wanted. As their high school relationship begins to unravel under the pressures of distance and self-discovery, they’ll learn that the bravest versions of themselves emerge when they let life redirect them.",
      "poster": "https://image.tmdb.org/t/p/w500/sEIP1pTVXa8BJaYSuVeVG3wFN10.jpg",
      "releaseInfo": "2025-11-27"
    },
    {
      "id": "tmdb:1218762",
      "type": "movie",
      "name": "Jingle Bell Heist",
      "description": "Two down-on-their-luck hourly workers team up to rob a posh London department store on Christmas Eve. Will they steal each other's hearts along the way?",
      "poster": "https://image.tmdb.org/t/p/w500/rVOQF2Ucekug1B80A9crVx7Jn90.jpg",
      "releaseInfo": "2025-11-26"
    },
    {
      "id": "tmdb:1448560",
      "type": "movie",
      "name": "Wildcat",
      "description": "An ex-black ops team reunite to pull off a desperate heist in order to save the life of their leader’s eight-year-old daughter.",
      "poster": "https://image.tmdb.org/t/p/w500/h893ImjM6Fsv5DFhKJdlZFZIJno.jpg",
      "releaseInfo": "2025-11-25"
    },
    {
      "id": "tmdb:1581099",
      "type": "movie",
      "name": "Kevin Hart: Acting My Age",
      "description": "Older, wiser — and still hilarious. Kevin Hart opens up about his midlife mishaps, from intimacy pills to the perils of unexpected injuries.",
      "poster": "https://image.tmdb.org/t/p/w500/89HPieER8jX9sGKKzhagGIGkMxi.jpg",
      "releaseInfo": "2025-11-24"
    },
    {
      "id": "tmdb:1563925",
      "type": "movie",
      "name": "Chris Hemsworth: A Road Trip to Remember",
      "description": "In his most personal documentary yet, Chris Hemsworth turns the camera on his own family after his dad’s recent Alzheimer’s diagnosis. They embark on a road trip into their past, exploring the science of social connection and how it can support memory function. They revisit meaningful places and faces, capturing it all as a home movie, and reviving treasured recollections.",
      "poster": "https://image.tmdb.org/t/p/w500/uRvBvxOmqaCMeZNJGducuh2WsgE.jpg",
      "releaseInfo": "2025-11-23"
    },
    {
      "id": "tmdb:1547917",
      "type": "movie",
      "name": "Melt My Heart This Christmas",
      "description": "Holly, a passionate glassblower, has big dreams of showcasing her art at the local fair, but keeps getting rejected. So, she jumps at the opportunity to help a legendary glassblower while also helping Jack, the man who oversees the entries. Things get complicated when Holly starts secretly displaying her own art under a pseudonym — and it becomes a hit — but she also starts getting closer to Jack.",
      "poster": "https://image.tmdb.org/t/p/w500/10RrWFTCWL01PG2cDOQBEY0GojR.jpg",
      "releaseInfo": "2025-11-23"
    },
    {
      "id": "tmdb:1564232",
      "type": "movie",
      "name": "Sebastian Maniscalco: It Ain't Right",
      "description": "Filmed live at the legendary United Center arena in Chicago, Sebastian Maniscalco goes all in on family chaos, aging, and the little things that drive us all nuts—with his one-of-a-kind comedic bite.",
      "poster": "https://image.tmdb.org/t/p/w500/jUivIhNxzyhfJuYOUxaWNRcgivQ.jpg",
      "releaseInfo": "2025-11-21"
    },
    {
      "id": "tmdb:1559572",
      "type": "movie",
      "name": "ONE SHOT with Ed Sheeran",
      "description": "One singer. One city. One shot. Ed Sheeran rocks the streets of New York with his greatest hits in this groundbreaking, real-time music experience.",
      "poster": "https://image.tmdb.org/t/p/w500/iSYHqrzvIuDm2HQ3ozM2vLugpRk.jpg",
      "releaseInfo": "2025-11-21"
    },
    {
      "id": "tmdb:1309012",
      "type": "movie",
      "name": "Altered",
      "description": "In an alternate present, genetically enhanced humans dominate society. Outcasts Leon and Chloe fight for justice against corrupt politicians exploiting genetic disparity, risking everything to challenge the oppressive system.",
      "poster": "https://image.tmdb.org/t/p/w500/6QlAcGRaUrgHcZ4WTBh5lsPnzKx.jpg",
      "releaseInfo": "2025-11-21"
    },
    {
      "id": "tmdb:1363123",
      "type": "movie",
      "name": "The Family Plan 2",
      "description": "Now that Dan's assassin days are behind him, all he wants for Christmas is quality time with his kids. But when he learns his daughter has her own plans, he books a family trip to London—putting them all in the crosshairs of an unexpected enemy.",
      "poster": "https://image.tmdb.org/t/p/w500/semFxuYx6HcrkZzslgAkBqfJvZk.jpg",
      "releaseInfo": "2025-11-20"
    },
    {
      "id": "tmdb:1363282",
      "type": "movie",
      "name": "The Carman Family Deaths",
      "description": "A young man's dramatic rescue at sea spirals into accusations he murdered two members of his wealthy New England family.",
      "poster": "https://image.tmdb.org/t/p/w500/yFc6F5PmAIdqpAU9wReCqLHWwMm.jpg",
      "releaseInfo": "2025-11-19"
    },
    {
      "id": "tmdb:1323475",
      "type": "movie",
      "name": "Champagne Problems",
      "description": "A driven American exec heads to Paris determined to acquire a champagne brand by Christmas — and accidentally falls for the heir to the bubbly empire.",
      "poster": "https://image.tmdb.org/t/p/w500/A2TCPPkzmWd5SwjBlxMlB6yQ4yK.jpg",
      "releaseInfo": "2025-11-19"
    },
    {
      "id": "tmdb:967941",
      "type": "movie",
      "name": "Wicked: For Good",
      "description": "As an angry mob rises against the Wicked Witch, Glinda and Elphaba will need to come together one final time. With their singular friendship now the fulcrum of their futures, they will need to truly see each other, with honesty and empathy, if they are to change themselves, and all of Oz, for good.",
      "poster": "https://image.tmdb.org/t/p/w500/si9tolnefLSUKaqQEGz1bWArOaL.jpg",
      "releaseInfo": "2025-11-17"
    },
    {
      "id": "tmdb:1580253",
      "type": "movie",
      "name": "Hazbin Hotel: Live on Broadway",
      "description": "Hosted by series lead Erika Henningsen, at New York’s historic Majestic Theater, this concert event features performances of the show's hit songs from Seasons One and Two by Erika Henningsen, Blake Roman, Amir Talai, Christian Borle, Jessica Vosk, Jeremy Jordan, and Krystina Alabado, with special appearances by Stephanie Beatriz, Kimiko Glenn, Vivienne Medrano, Sam Haft, and Richard Horvitz.",
      "poster": "https://image.tmdb.org/t/p/w500/5GkJfdtw1aNh67Iunv8F6B3MR6K.jpg",
      "releaseInfo": "2025-11-17"
    },
    {
      "id": "tmdb:1537084",
      "type": "movie",
      "name": "Three Wisest Men",
      "description": "Luke is expecting twins, Taylor is debating a life-changing job, and Stephan is planning a wedding — all while their mom is planning to put the family home up for sale.",
      "poster": "https://image.tmdb.org/t/p/w500/pThRtEIcIJQunJIJvXfwzpHQuMs.jpg",
      "releaseInfo": "2025-11-15"
    },
    {
      "id": "tmdb:1426083",
      "type": "movie",
      "name": "Escobank",
      "description": "A ragtag group of misfits, veterans and ex-cons embark on a perilous journey in the jungles of Colombia to find the buried barrels of cash left behind by legendary drug kingpin Pablo Escobar before his downfall.",
      "poster": "https://image.tmdb.org/t/p/w500/5G0pPDxAKWgQy24NHBGl8LYPxIH.jpg",
      "releaseInfo": "2025-11-14"
    },
    {
      "id": "tmdb:1310568",
      "type": "movie",
      "name": "Murder at the Embassy",
      "description": "1934. Private detective Miranda Green investigates a murder perpetrated in the British Embassy in Cairo, where a top secret document was stolen, risking to jeopardize both Buckingham Palace and the peace of the world. All those present in this closed place are suspected: the American photographer, the English student, the American actress, the Egyptian security guard, the ambassador interpreter, the Egyptian gardener and - why not? — the Ambassador himself. But who would have expected that a small group of Nazis would be behind a plot, risking to jeopardize both Buckingham Palace and the peace of the world?",
      "poster": "https://image.tmdb.org/t/p/w500/3DBmBItPdy0A2ol59jgHhS54Lua.jpg",
      "releaseInfo": "2025-11-14"
    },
    {
      "id": "tmdb:1235246",
      "type": "movie",
      "name": "Christmas Karma",
      "description": "In contemporary London, miserly British-Indian businessman Eshan Sood is compelled by three ghosts to reflect on his life and to consider the needs of those around him.",
      "poster": "https://image.tmdb.org/t/p/w500/axkX8p8OyvGTsr8q2MXO3EjMwqO.jpg",
      "releaseInfo": "2025-11-14"
    },
    {
      "id": "tmdb:628847",
      "type": "movie",
      "name": "Trap House",
      "description": "An undercover DEA agent and his partner embark on a game of cat and mouse with an audacious, and surprising group of thieves - their own rebellious teenagers, who have begun robbing from a dangerous cartel, using their parents' tactics and top-secret intel to do it.",
      "poster": "https://image.tmdb.org/t/p/w500/ctU9S47MoJDN9CB7SCaitcfyyIu.jpg",
      "releaseInfo": "2025-11-14"
    },
    {
      "id": "tmdb:1439112",
      "type": "movie",
      "name": "Muzzle: City of Wolves",
      "description": "LAPD officer Jake Rosser endeavors to lead a peaceful life with his family and retired K-9 officer, Socks. However, tranquility dissolves into chaos when a gang targets them in a brutal attack. Alongside his new K-9 partner Argos, Jake launches into a relentless pursuit of justice, determined to protect his loved ones.",
      "poster": "https://image.tmdb.org/t/p/w500/8qTMRmC07XCGidnKQFLbRM3FoDU.jpg",
      "releaseInfo": "2025-11-14"
    },
    {
      "id": "tmdb:1286185",
      "type": "movie",
      "name": "The Carpenter's Son",
      "description": "A remote village in Roman-era Egypt explodes into spiritual warfare when a carpenter, his wife and their child are targeted by supernatural forces.",
      "poster": "https://image.tmdb.org/t/p/w500/tXEtdZjoaHqjDjSxZJWwDVjIfx9.jpg",
      "releaseInfo": "2025-11-14"
    },
    {
      "id": "tmdb:1288072",
      "type": "movie",
      "name": "Keeper",
      "description": "Liz and Malcolm escape for a romantic anniversary weekend at a secluded cabin. When Malcolm suddenly returns to the city, Liz finds herself isolated and in the presence of an unspeakable evil that reveals the cabin's horrifying secrets.",
      "poster": "https://image.tmdb.org/t/p/w500/mbGHijUc0C3fcM12l6ro6FgxIvg.jpg",
      "releaseInfo": "2025-11-14"
    },
    {
      "id": "tmdb:798645",
      "type": "movie",
      "name": "The Running Man",
      "description": "Desperate to save his sick daughter, working-class Ben Richards is convinced by The Running Man's charming but ruthless producer to enter the deadly competition game as a last resort. But Ben's defiance, instincts, and grit turn him into an unexpected fan favorite — and a threat to the entire system. As ratings skyrocket, so does the danger, and Ben must outwit not just the Hunters, but a nation addicted to watching him fall.",
      "poster": "https://image.tmdb.org/t/p/w500/dKL78O9zxczVgjtNcQ9UkbYLzqX.jpg",
      "releaseInfo": "2025-11-14"
    },
    {
      "id": "tmdb:1084242",
      "type": "movie",
      "name": "Zootopia 2",
      "description": "After cracking the biggest case in Zootopia's history, rookie cops Judy Hopps and Nick Wilde find themselves on the twisting trail of a great mystery when Gary De'Snake arrives and turns the animal metropolis upside down. To crack the case, Judy and Nick must go undercover to unexpected new parts of town, where their growing partnership is tested like never before.",
      "poster": "https://image.tmdb.org/t/p/w500/bjUWGw0Ao0qVWxagN3VCwBJHVo6.jpg",
      "releaseInfo": "2025-11-13"
    },
    {
      "id": "tmdb:1559760",
      "type": "movie",
      "name": "Thoughts & Prayers",
      "description": "In a dystopic America, children are taught how to prepare for school shootings through elaborate drills. Yet what are intended as self-defense mechanisms are themselves deeply traumatic for students, parents, educators, and entire communities.",
      "poster": "https://image.tmdb.org/t/p/w500/y9GzO4jCjpurBWvgGp6clqdSK1G.jpg",
      "releaseInfo": "2025-11-12"
    },
    {
      "id": "tmdb:1401318",
      "type": "movie",
      "name": "A Merry Little Ex-Mas",
      "description": "All Kate and Everett want for Christmas is an amicable divorce and one last holiday as a family, but new flames and old feelings complicate their plans.",
      "poster": "https://image.tmdb.org/t/p/w500/w4ytu75uJ1b0AgPd0wLm7iZMsWJ.jpg",
      "releaseInfo": "2025-11-12"
    },
    {
      "id": "tmdb:1426518",
      "type": "movie",
      "name": "Being Eddie",
      "description": "From teen comedian to Hollywood legend, Eddie Murphy revisits his extraordinary showbiz ride with raw honesty and humor.",
      "poster": "https://image.tmdb.org/t/p/w500/8behxK3x7kiCupdrENmOCkOcs8N.jpg",
      "releaseInfo": "2025-11-12"
    },
    {
      "id": "tmdb:1248226",
      "type": "movie",
      "name": "Playdate",
      "description": "When out-of-work accountant Brian joins stay-at-home dad Jeff for a playdate with their sons, he expects a laid-back afternoon. Instead, they're chased by mercenaries, and Brian—totally unprepared—must survive one absurd obstacle after another.",
      "poster": "https://image.tmdb.org/t/p/w500/fGodXWqJkkkbSebPIlxLSygV8GY.jpg",
      "releaseInfo": "2025-11-12"
    },
    {
      "id": "tmdb:1278983",
      "type": "movie",
      "name": "Under the Stars",
      "description": "A struggling romance novelist stuck in a passionless relationship goes to Italy seeking inspiration, and unexpectedly finds the girl of his dreams.",
      "poster": "https://image.tmdb.org/t/p/w500/oJjCXVwPbNq2QeNdNvG2atZHj11.jpg",
      "releaseInfo": "2025-11-11"
    },
    {
      "id": "tmdb:1578602",
      "type": "movie",
      "name": "A Holiday Short: Best Christmas Ever",
      "description": "When Santa mistakes the doodle on a girl's list for a holiday wish, she wakes up on Christmas morning to find an unusual new friend under the tree.",
      "poster": "https://image.tmdb.org/t/p/w500/wSZmNfmpFHTxuLbDFfryThpnkJQ.jpg",
      "releaseInfo": "2025-11-10"
    },
    {
      "id": "tmdb:1425122",
      "type": "movie",
      "name": "A Very Jonas Christmas Movie",
      "description": "Kevin, Nick, and Joe Jonas face a series of escalating obstacles as they struggle to make it from London to New York in time to spend Christmas with their families.",
      "poster": "https://image.tmdb.org/t/p/w500/kGLgaDrYWmTAdRFzGP5pBquRnhO.jpg",
      "releaseInfo": "2025-11-10"
    },
    {
      "id": "tmdb:1547913",
      "type": "movie",
      "name": "A Keller Christmas Vacation",
      "description": "The Keller family, including the parents and their three adult children, decide to take a European river cruise touring the Christmas Markets over the holidays, and each sibling is going through their own life challenge.",
      "poster": "https://image.tmdb.org/t/p/w500/4RiHKqA8d36YKvkbfl0YCcPLgt1.jpg",
      "releaseInfo": "2025-11-09"
    },
    {
      "id": "tmdb:1537081",
      "type": "movie",
      "name": "Christmas Above the Clouds",
      "description": "When a workaholic CEO tries to skip Christmas by flying to Australia, she’s in for the flight of her life. Haunted by her past, present, and future, she’s forced to confront the choices that led to her success yet left her flying solo. With the help of three quirky spirits and a surprise reunion with her ex, she might just rediscover the magic of Christmas—and the love she thought she’d lost.",
      "poster": "https://image.tmdb.org/t/p/w500/sMHF7beWXqWzXqtclqrz6vd95xV.jpg",
      "releaseInfo": "2025-11-08"
    },
    {
      "id": "tmdb:1358042",
      "type": "movie",
      "name": "Scarlet Nose: The Prologue",
      "description": "In 1973, two teens come face to face with a brutal clown masked killer that has an unlikely weakness.",
      "poster": "https://image.tmdb.org/t/p/w500/ooow52QdmdvRgicDBisYdq5v6E6.jpg",
      "releaseInfo": "2025-11-08"
    },
    {
      "id": "tmdb:1287814",
      "type": "movie",
      "name": "Stone Cold Fox",
      "description": "In this '80s-set revenge story, the defiant Fox breaks out of an abusive commune in search of her family. But when the queenpin kidnaps her little sister and sends a crooked cop after her, Fox has no choice but to infiltrate the very place she escaped.",
      "poster": "https://image.tmdb.org/t/p/w500/oQbQmatyiRFsYuLOSxAxxG0E0Kl.jpg",
      "releaseInfo": "2025-11-07"
    },
    {
      "id": "tmdb:1117857",
      "type": "movie",
      "name": "In Your Dreams",
      "description": "Stevie and her little brother Elliot journey into the wildly absurd landscape of their own dreams to ask the Sandman to grant them the perfect family.",
      "poster": "https://image.tmdb.org/t/p/w500/ug0TqgmByPCEYzR9lQWQmyAa7sw.jpg",
      "releaseInfo": "2025-11-07"
    },
    {
      "id": "tmdb:1090983",
      "type": "movie",
      "name": "The Beldham",
      "description": "At the edge of postpartum psychosis, new mother Harper moves in with her own mother at their family's rural farmhouse. Soon she finds herself hunted by a threatening monster who has designs on her child.",
      "poster": "https://image.tmdb.org/t/p/w500/lFI5tremdnUNCANC0u27Ifedkyh.jpg",
      "releaseInfo": "2025-11-07"
    },
    {
      "id": "tmdb:1576287",
      "type": "movie",
      "name": "Frankenstein: The Anatomy Lesson",
      "description": "Go deep behind the scenes with visionary filmmaker Guillermo del Toro and the \"Frankenstein\" cast and crew as they give new life to the classic tale.",
      "poster": "https://image.tmdb.org/t/p/w500/l1F9EIwShcQX7kmnqucIBsXUG5S.jpg",
      "releaseInfo": "2025-11-07"
    },
    {
      "id": "tmdb:1325678",
      "type": "movie",
      "name": "Sarah's Oil",
      "description": "Sarah Rector, an African-American girl born in Oklahoma Indian Territory in the early 1900s, believes there is oil beneath the barren land she’s allotted, and her faith is proven right. As greedy oil sharks close in, Sarah turns to her family, friends, and some Texas wildcatters to maintain control of her oil-rich land, eventually becoming among the nation's first female African-American millionaires—at eleven years old.",
      "poster": "https://image.tmdb.org/t/p/w500/Av1CK61z33v2OBFLD1yF5rdRxQ1.jpg",
      "releaseInfo": "2025-11-07"
    },
    {
      "id": "tmdb:1479945",
      "type": "movie",
      "name": "Wicked: One Wonderful Night",
      "description": "Cynthia Erivo and Ariana Grande lead a one-time-only, two-hour special featuring electrifying performances alongside their Wicked: For Good co-stars for a night of reimagined musical arrangements, cast interviews, behind-the-scenes moments, exclusive surprises, and a sneak peek at Wicked: For Good.",
      "poster": "https://image.tmdb.org/t/p/w500/vI8gfZVhPnYo0gjK6vSP7p3idpV.jpg",
      "releaseInfo": "2025-11-06"
    },
    {
      "id": "tmdb:1252382",
      "type": "movie",
      "name": "Tyler Perry's Finding Joy",
      "description": "Joy, a successful designer, seeks a proposal at Christmas. In Wyoming's mountains, she finds what she truly needs when the man she loves sees her as just a friend.",
      "poster": "https://image.tmdb.org/t/p/w500/sUMdbrjHhMFDY327B31ctpF9MuY.jpg",
      "releaseInfo": "2025-11-05"
    },
    {
      "id": "tmdb:1574042",
      "type": "movie",
      "name": "Predator: Wastelands",
      "description": "When an alien hunter arrives on Earth, it takes down a gang of warlords and unexpectedly becomes a folk hero to the oppressed locals. Now, with their support, the alien sets its sights on the warlords' ruthless leader.",
      "poster": "https://image.tmdb.org/t/p/w500/bQ0neJZ5QAD6jRHIbbdx2rtMBUb.jpg",
      "releaseInfo": "2025-11-04"
    },
    {
      "id": "tmdb:1242501",
      "type": "movie",
      "name": "Icefall",
      "description": "A young Indigenous game warden arrests an infamous poacher only to discover that the poacher knows the location of a plane carrying millions of dollars that has crashed in a frozen lake. When a group of criminals and dirty cops are alerted to the poacher’s whereabouts, the warden and the poacher team up to fight back and escape across the treacherous lake before the ice melts.",
      "poster": "https://image.tmdb.org/t/p/w500/5Byv6nznAb2Izd0gHpODOXnuSbo.jpg",
      "releaseInfo": "2025-11-04"
    },
    {
      "id": "tmdb:1242898",
      "type": "movie",
      "name": "Predator: Badlands",
      "description": "Cast out from his clan, a young Predator finds an unlikely ally in a damaged android and embarks on a treacherous journey in search of the ultimate adversary.",
      "poster": "https://image.tmdb.org/t/p/w500/ef2QSeBkrYhAdfsWGXmp0lvH0T1.jpg",
      "releaseInfo": "2025-11-03"
    },
    {
      "id": "tmdb:1497036",
      "type": "movie",
      "name": "Dr. Seuss's The Sneetches",
      "description": "An unexpected friendship forms between two young Sneetches on an island surrounded by beaches in this sweet musical special set in the world of Seuss.",
      "poster": "https://image.tmdb.org/t/p/w500/5jqpfOY6q8ltnCFEfUPY3c0bpR5.jpg",
      "releaseInfo": "2025-11-03"
    },
    {
      "id": "tmdb:1537560",
      "type": "movie",
      "name": "A Newport Christmas",
      "description": "A charitable and spirited Newport socialite in 1905 finds out her father intends for her to become engaged to a man she’s never met at the upcoming Christmas Eve ball. When she wishes for a different life, a man appears — and she somehow time-travels to 2025.",
      "poster": "https://image.tmdb.org/t/p/w500/bNWUsEOg7HzHlZmSTVKuZ6SglxM.jpg",
      "releaseInfo": "2025-11-02"
    },
    {
      "id": "tmdb:425274",
      "type": "movie",
      "name": "Now You See Me: Now You Don't",
      "description": "The original Four Horsemen reunite with a new generation of illusionists to take on powerful diamond heiress Veronika Vanderberg, who leads a criminal empire built on money laundering and trafficking. The new and old magicians must overcome their differences to work together on their most ambitious heist yet.",
      "poster": "https://image.tmdb.org/t/p/w500/oD3Eey4e4Z259XLm3eD3WGcoJAh.jpg",
      "releaseInfo": "2025-11-01"
    },
    {
      "id": "tmdb:1547885",
      "type": "movie",
      "name": "Christmas on Duty",
      "description": "Longtime rivals who trained together at the Basic School in Quantico are forced to work together once again after years of not speaking, and when a snowstorm prevents all the Christmas presents from being delivered to base, they are forced to team up for a special mission… to save Christmas.",
      "poster": "https://image.tmdb.org/t/p/w500/cFmKCYpJGf4vgBxvvPFABnGG1DS.jpg",
      "releaseInfo": "2025-11-01"
    },
    {
      "id": "tmdb:1570554",
      "type": "movie",
      "name": "Joy to the World",
      "description": "Lifestyle guru Joy Edwards - whose cookbooks feature her perfect home life and family - is horrified when a TV network decides to film Christmas dinner at her fabled, but fabricated, country home. Now, she must recruit her best friend Max to pose as her fake husband for the cameras - but they both discover something real along the way.",
      "poster": "https://image.tmdb.org/t/p/w500/bCtkAgxvInB3AKbENB56OHt90yN.jpg",
      "releaseInfo": "2025-11-01"
    },
    {
      "id": "tmdb:1033148",
      "type": "movie",
      "name": "Die My Love",
      "description": "Grace and her partner Jackson move into an old country house. She pursues her dream of writing, and the couple welcome a baby soon after. However, with Jackson frequently absent, and the pressures of domestic life weighing on her, Grace begins to unravel, leaving a path of destruction in her wake.",
      "poster": "https://image.tmdb.org/t/p/w500/kajpShbFhOdpl6yCrLezMrr9tB4.jpg",
      "releaseInfo": "2025-11-01"
    },
    {
      "id": "tmdb:1211776",
      "type": "movie",
      "name": "Violent Ends",
      "description": "Lucas Frost, an honest man brought up in a crime family whose only legacy is violence, tries to make his own life with his fiancée, Emma. He is suddenly pulled back into the family business he so despises when his cousin, Eli, perpetrates an armed robbery on a local scrap yard and an innocent life is caught in the crossfire.",
      "poster": "https://image.tmdb.org/t/p/w500/9BrXyyrd5amNmpbZNc4gSblt6kQ.jpg",
      "releaseInfo": "2025-10-31"
    },
    {
      "id": "tmdb:1522923",
      "type": "movie",
      "name": "Safe House",
      "description": "Trapped in a high-security safe house after a terrorist attack in downtown Los Angeles, six government agents realize they must survive not just the enemy outside, but the potential traitor among them.",
      "poster": "https://image.tmdb.org/t/p/w500/peUlWeJaqTi0YnsM4L6gnWzz0Ko.jpg",
      "releaseInfo": "2025-10-31"
    },
    {
      "id": "tmdb:1571470",
      "type": "movie",
      "name": "The Rats: A Witcher Tale",
      "description": "To pull off a daring heist, a gang of six misfit outlaws will have to do something they've never done before: trust each other — and a washed-up Witcher.",
      "poster": "https://image.tmdb.org/t/p/w500/1T0kO1cgR430AC9I6jurMOezKwg.jpg",
      "releaseInfo": "2025-10-30"
    },
    {
      "id": "tmdb:1550569",
      "type": "movie",
      "name": "Aileen: Queen of the Serial Killers",
      "description": "Aileen Wuornos remains a rarity: a female serial killer. From childhood abuse to death-row revelations, this documentary revisits her life and crimes.",
      "poster": "https://image.tmdb.org/t/p/w500/iBCorGTwpXhIOeWwTA21HC5Rprx.jpg",
      "releaseInfo": "2025-10-30"
    },
    {
      "id": "tmdb:1126336",
      "type": "movie",
      "name": "Anniversary",
      "description": "When Ellen and Paul’s son introduces his new girlfriend one lovely afternoon at their 25th anniversary party, no one suspects that it is the beginning of the end for this happy family. The new girlfriend is Liz, Ellen’s former student, who left the university, some years before, after Ellen called her out in class for her radical ideology.",
      "poster": "https://image.tmdb.org/t/p/w500/sSdpXGBNt3mQzjZZVK6eV5NcPdc.jpg",
      "releaseInfo": "2025-10-29"
    },
    {
      "id": "tmdb:1214130",
      "type": "movie",
      "name": "Stitch Head",
      "description": "Stitch Head was the first creature brought to 'almost life' by mad professor Erasmus. In the years since, he’s become nursemaid to the master’s ever-growing menagerie of neglected creatures, tasked with teaching them to suppress their 'inner monster' and hide out in the castle — away from prying eyes and itchy pitchfork fingers, of the village mob in the valley below. But when grubby circus impresario Fulbert Freakfinder arrives offering Stitch Head a starring role in his freak show, our hero is tempted by the promise of love and acceptance.",
      "poster": "https://image.tmdb.org/t/p/w500/p0ZOIaQ8oLEGmQVrYcmvIOUuSqs.jpg",
      "releaseInfo": "2025-10-29"
    },
    {
      "id": "tmdb:991494",
      "type": "movie",
      "name": "The SpongeBob Movie: Search for SquarePants",
      "description": "Desperate to be a big guy, SpongeBob sets out to prove his bravery to Mr. Krabs by following The Flying Dutchman – a mysterious swashbuckling ghost pirate – on a seafaring adventure that takes him to the deepest depths of the deep sea, where no Sponge has gone before.",
      "poster": "https://image.tmdb.org/t/p/w500/pDWYW9v8fmJdA7N0I1MOdQA3ETq.jpg",
      "releaseInfo": "2025-10-26"
    },
    {
      "id": "tmdb:339849",
      "type": "movie",
      "name": "Not Without Hope",
      "description": "A group of friends' fishing boat capsizes off the coast of Mexico and they're left alone stranded at sea and struggling for survival.",
      "poster": "https://image.tmdb.org/t/p/w500/w5WJMJ6DWPFK0Gx0Ongh0FZBAlK.jpg",
      "releaseInfo": "2025-10-25"
    },
    {
      "id": "tmdb:1547882",
      "type": "movie",
      "name": "Merry Christmas, Ted Cooper!",
      "description": "A Christmas-loving weatherman has had a tough year; upon returning to his hometown, he bumps into a former teacher who always cheered him on, and his former crush — and things start to look up.",
      "poster": "https://image.tmdb.org/t/p/w500/cdPfcMltESmaYukwnDqvDcqEJUF.jpg",
      "releaseInfo": "2025-10-25"
    },
    {
      "id": "tmdb:1549292",
      "type": "movie",
      "name": "LEGO Frozen: Operation Puffins",
      "description": "After the events of Frozen, Anna and Elsa want to start fresh in Arendelle, and make the castle feel a bit more comfortable. While they struggle to break free of the bounds of tradition, the Duke of Weselton has other plans for their beloved home alongside a flock of menacing puffins.",
      "poster": "https://image.tmdb.org/t/p/w500/4gcpeI5drcUI81KbZjRLm4EAJII.jpg",
      "releaseInfo": "2025-10-24"
    },
    {
      "id": "tmdb:1327862",
      "type": "movie",
      "name": "Regretting You",
      "description": "Morgan Grant and her daughter Clara explore what's left behind after a devastating accident reveals a shocking betrayal and forces them to confront family secrets, redefine love, and rediscover each other.",
      "poster": "https://image.tmdb.org/t/p/w500/z4gVnxTaks3anTycwKjDmvQSuWt.jpg",
      "releaseInfo": "2025-10-24"
    },
    {
      "id": "tmdb:1566230",
      "type": "movie",
      "name": "Michelle Wolf: The Well",
      "description": "Michelle Wolf gets real about white women, serial killers and adjusting to motherhood in this sharp, unfiltered stand-up special.",
      "poster": "https://image.tmdb.org/t/p/w500/mY1dUsGEYrDzbPTrIW56r48xH2q.jpg",
      "releaseInfo": "2025-10-21"
    },
    {
      "id": "tmdb:1469354",
      "type": "movie",
      "name": "Border Hunters",
      "description": "After his police officer brother is killed by a drug dealer who flees to the protection of his cartel-connected uncle in Mexico, an American man with a diverse law enforcement/military background goes south of the border to get revenge",
      "poster": "https://image.tmdb.org/t/p/w500/6TNFZnJ5CU0uFQxGaO9dbqriiI7.jpg",
      "releaseInfo": "2025-10-20"
    },
    {
      "id": "tmdb:1538155",
      "type": "movie",
      "name": "A Christmas Angel Match",
      "description": "Christmas angels used to working alone to bring “destined soulmates together” over the holidays, are unexpectedly paired; soon, their “clashing styles – and the undeniable spark growing between them – complicate their mission.”",
      "poster": "https://image.tmdb.org/t/p/w500/cQPu03UcWxnnby7F5iUqU27MY0v.jpg",
      "releaseInfo": "2025-10-19"
    },
    {
      "id": "tmdb:1214931",
      "type": "movie",
      "name": "Nuremberg",
      "description": "In postwar Germany, an American psychiatrist must determine whether Nazi prisoners are fit to go on trial for war crimes, and finds himself in a complex battle of intellect and ethics with Hermann Göring, Hitler's right-hand man.",
      "poster": "https://image.tmdb.org/t/p/w500/sxu8TsG7k06ymWL98ELEIE1EMZV.jpg",
      "releaseInfo": "2025-10-18"
    },
    {
      "id": "tmdb:1535440",
      "type": "movie",
      "name": "A Christmas Prayer",
      "description": "Natalie is a children’s book illustrator struggling with creative burnout that finds unexpected inspiration when she comes across a little girl’s Christmas gift list. Unlike other children’s Christmas lists, Caroline writes her list of heartfelt prayers to Jesus, requesting blessings for her family, friends, and community – including one to ask that her recently widowed dad will find happiness again. Touched by Caroline’s list, Natalie begins to secretly fulfill each blessing. In turn, she is inspired to create a new character, Adeline the Angel, to illustrate the ways Jesus quietly works through everyday people to answer prayers with love and grace.",
      "poster": "https://image.tmdb.org/t/p/w500/yeMqFBJDMqiO1OZoyJ2eSTMSPY1.jpg",
      "releaseInfo": "2025-10-18"
    },
    {
      "id": "tmdb:1535223",
      "type": "movie",
      "name": "A Royal Montana Christmas",
      "description": "A princess looking to decompress before the holidays heads to a Montana ranch and meets a charming guide.",
      "poster": "https://image.tmdb.org/t/p/w500/uZAlg4qaZONhLcco7n8hFzWLBsU.jpg",
      "releaseInfo": "2025-10-18"
    },
    {
      "id": "tmdb:1519317",
      "type": "movie",
      "name": "AEW WrestleDream 2025",
      "description": "The 2025 WrestleDream was a professional wrestling pay-per-view (PPV) event produced by the American promotion All Elite Wrestling (AEW). It was the third WrestleDream event and took place on October 18, 2025, at the Chaifetz Arena in St. Louis, Missouri. Like the previous events, this was a tribute event in honor of New Japan Pro-Wrestling (NJPW) founder Antonio Inoki, who passed away on October 1, 2022, and was headlined by Jon Moxley vs. Darby Allin in an I Quit Match.",
      "poster": "https://image.tmdb.org/t/p/w500/xoSYwZl2AYw3GhgjT6SMsBCA95.jpg",
      "releaseInfo": "2025-10-18"
    },
    {
      "id": "tmdb:1551003",
      "type": "movie",
      "name": "R.L. Stine's Pumpkinhead",
      "description": "When his brother disappears and everyone forgets he existed, Sam must unravel the mystery before Finn is gone forever.",
      "poster": "https://image.tmdb.org/t/p/w500/gRJFFA9lK9pLikEIMcetgkmOGTj.jpg",
      "releaseInfo": "2025-10-17"
    },
    {
      "id": "tmdb:1491479",
      "type": "movie",
      "name": "Grow",
      "description": "In the self-proclaimed ‘Pumpkin Capital of the World’, no-nonsense curmudgeonly farmer Dinah Little takes in her estranged niece Charlie, who decides to enter the local pumpkin growing competition where she and the other growers face fierce competition, sabotage, and a genetically engineered rival.",
      "poster": "https://image.tmdb.org/t/p/w500/z5OjHr4QFOpVq8AicumXl0gm8Mb.jpg",
      "releaseInfo": "2025-10-17"
    },
    {
      "id": "tmdb:1336189",
      "type": "movie",
      "name": "Delivery Run",
      "description": "A food delivery driver gets caught in a deadly chase in the icy Minnesota wilderness, pursued by a crazed snowplow driver for unknown reasons, facing life-threatening situations and forced to outsmart his relentless pursuer alone.",
      "poster": "https://image.tmdb.org/t/p/w500/eCA5maHDlZtXNTtiLXenwnEw7tc.jpg",
      "releaseInfo": "2025-10-17"
    },
    {
      "id": "tmdb:1362315",
      "type": "movie",
      "name": "The Hand That Rocks the Cradle",
      "description": "Suburban couple Caitlin and Miguel hire seemingly sweet Polly to take care of their newborn baby. But Polly's true motives have little to do with singing lullabies...",
      "poster": "https://image.tmdb.org/t/p/w500/uXqqFkLcMPORg3TsQbK4upozZXB.jpg",
      "releaseInfo": "2025-10-16"
    },
    {
      "id": "tmdb:1073572",
      "type": "movie",
      "name": "Out Standing",
      "description": "Officer Sandra Perron resigns from the Canadian military after a controversial photo surfaces. Adapting to civilian life amidst an investigation, she denies abuse allegations despite evidence suggesting mistreatment within her unit.",
      "poster": "https://image.tmdb.org/t/p/w500/gQRaEoRd1fv1A3orWOA9AdSrIjz.jpg",
      "releaseInfo": "2025-10-16"
    },
    {
      "id": "tmdb:1548017",
      "type": "movie",
      "name": "The Family McMullen",
      "description": "30 years after the events of The Brothers McMullen, romantic entanglements plague a now fiftysomething Barry McMullen and his twentysomething kids, as well as his brother Patrick and widowed sister-in-law Molly, who are also facing similar unexpected hurdles.",
      "poster": "https://image.tmdb.org/t/p/w500/foNIl77csO9GmsvCvTZ6ixt0fZf.jpg",
      "releaseInfo": "2025-10-15"
    },
    {
      "id": "tmdb:1169210",
      "type": "movie",
      "name": "The Mannequin",
      "description": "A stylist assistant investigates her sister's death in a historic LA building, only to face a vengeful ghost of a serial killer who dismembered victims decades ago. She must escape before she's next.",
      "poster": "https://image.tmdb.org/t/p/w500/oFTpB1gzS02LtrsenTWxOKbsMpM.jpg",
      "releaseInfo": "2025-10-14"
    },
    {
      "id": "tmdb:927254",
      "type": "movie",
      "name": "The Twits",
      "description": "When the meanest, nastiest villains pull a trick to take over their town, two brave children team up with a family of magical animals to bring them down.",
      "poster": "https://image.tmdb.org/t/p/w500/izYZGeOHhPWiga8Hb5P4JYfcH8T.jpg",
      "releaseInfo": "2025-10-13"
    },
    {
      "id": "tmdb:1306400",
      "type": "movie",
      "name": "Merrily We Roll Along",
      "description": "Franklin Shepard is a talented Broadway composer who abandons his theater career and all his friends in New York in order to produce films in Los Angeles. The story begins at the height of his Hollywood fame and moves backwards in time, showing snapshots of the most important moments in Frank’s life that shaped the man he is today. A live recording of the 2024 Tony Award-winning Broadway revival of Stephen Sondheim and George Furth's musical, filmed at the Hudson Theatre in New York City.",
      "poster": "https://image.tmdb.org/t/p/w500/8h3uNPMdQKr7ffwAjU0aURFqIK.jpg",
      "releaseInfo": "2025-10-12"
    },
    {
      "id": "tmdb:1443940",
      "type": "movie",
      "name": "Truth & Treason",
      "description": "When loyalty to country becomes loyalty to a lie, one teen risks everything to expose the truth. With the Gestapo closing in, he must decide what it really means to be a good German.",
      "poster": "https://image.tmdb.org/t/p/w500/ArDLn658OjT3dMThIi4GDQJRuY3.jpg",
      "releaseInfo": "2025-10-11"
    },
    {
      "id": "tmdb:1477448",
      "type": "movie",
      "name": "Haul Out the Halloween",
      "description": "New, Halloween-obsessed neighbors inspire residents of Evergreen Lane to haul out their spookiest costumes and décor to become EverSCREAM Lane.",
      "poster": "https://image.tmdb.org/t/p/w500/jbPRLRliQFZJumIjzuQ6qsODnKm.jpg",
      "releaseInfo": "2025-10-11"
    },
    {
      "id": "tmdb:1474303",
      "type": "movie",
      "name": "WWE Crown Jewel 2025",
      "description": "The 2025 Crown Jewel, also promoted as Crown Jewel: Perth, was a professional wrestling event produced by the American company WWE. It was the seventh Crown Jewel and took place on Saturday, October 11, 2025, at the RAC Arena in Perth, Western Australia, Australia. The event featured the crowning of the second men's and women's Crown Jewel Champions and was the first Crown Jewel held outside of Saudi Arabia, as all previous editions took place in Riyadh. It also marked John Cena's last appearance in Australia as an in-ring performer before his retirement at the end of 2025, and was headlined by Seth Rollins vs. Cody Rhodes in a Champions vs. Champions match for the men's Crown Jewel Championship.",
      "poster": "https://image.tmdb.org/t/p/w500/iA2SexIKmmZGbQaZK10YIen3AKv.jpg",
      "releaseInfo": "2025-10-11"
    },
    {
      "id": "tmdb:1432605",
      "type": "movie",
      "name": "My Father's Shadow",
      "description": "Two young brothers explore Lagos with their estranged father during the 1993 Nigerian election crisis, witnessing both the city's magnitude and their father's daily struggles as political unrest threatens their journey home.",
      "poster": "https://image.tmdb.org/t/p/w500/aLQYyqWlIBBU3L8L84txbh0x1nq.jpg",
      "releaseInfo": "2025-10-11"
    },
    {
      "id": "tmdb:1196791",
      "type": "movie",
      "name": "Soul on Fire",
      "description": "After a horrific accident leaves his body scarred, a young boy strives to live and show everyone what is possible with the help of his family, his faith, his community, his longtime idol's kindness, and the entire city of St. Louis.",
      "poster": "https://image.tmdb.org/t/p/w500/iUMmG3Q0JyAuSx9QpIiMFhI5zDo.jpg",
      "releaseInfo": "2025-10-10"
    },
    {
      "id": "tmdb:1550785",
      "type": "movie",
      "name": "My Father, the BTK Killer",
      "description": "Raised by a man leading a monstrous double life, the daughter of the BTK serial killer shares her chilling story.",
      "poster": "https://image.tmdb.org/t/p/w500/47EblKlcEQ4lHdTVnay4P1d6thf.jpg",
      "releaseInfo": "2025-10-10"
    },
    {
      "id": "tmdb:1290879",
      "type": "movie",
      "name": "The Woman in Cabin 10",
      "description": "On a lavish yacht for an assignment, a journalist sees a passenger go overboard. But when no one believes her, she risks her life to uncover the truth.",
      "poster": "https://image.tmdb.org/t/p/w500/4kpdyePOlcELQQJcxXPF5GB1Adw.jpg",
      "releaseInfo": "2025-10-10"
    },
    {
      "id": "tmdb:524635",
      "type": "movie",
      "name": "The Chronology of Water",
      "description": "Growing up in an environment torn apart by violence and alcohol, a young woman finds her voice through the written word and her salvation as a swimmer.",
      "poster": "https://image.tmdb.org/t/p/w500/aqYIGdhDjWF1wKl2GTuRy1XtbkI.jpg",
      "releaseInfo": "2025-10-10"
    },
    {
      "id": "tmdb:1208348",
      "type": "movie",
      "name": "Rental Family",
      "description": "An American actor in Tokyo struggles to find purpose until he lands an unusual gig: working for a Japanese 'rental family' agency, playing stand-in roles for strangers. As he immerses himself in his clients' worlds, he begins to form genuine bonds that blur the lines between performance and reality.",
      "poster": "https://image.tmdb.org/t/p/w500/dGRZ55srJoK6TcjPTfHe701UWq0.jpg",
      "releaseInfo": "2025-10-09"
    },
    {
      "id": "tmdb:1540867",
      "type": "movie",
      "name": "SAQUON",
      "description": "SAQUON began as a video diary documenting his ACL recovery five years ago. But the camera kept rolling after his return, revealing an intimate journey through his frustrations over the lack of control of his career, quiet family moments, and ultimately, his dominant year with the Eagles, culminating in a storybook Super Bowl win on his birthday. This is Saquon like you have never seen him before.",
      "poster": "https://image.tmdb.org/t/p/w500/dNSfQmps989E4n1W6BbqlIbQKqx.jpg",
      "releaseInfo": "2025-10-09"
    },
    {
      "id": "tmdb:1492608",
      "type": "movie",
      "name": "John Candy: I Like Me",
      "description": "Those who knew iconic funnyman John Candy best share his story, in their own words, through never-before-seen archival footage, imagery, and interviews.",
      "poster": "https://image.tmdb.org/t/p/w500/mNEJdx9WSXeyMmkuQfTeY4zouNx.jpg",
      "releaseInfo": "2025-10-09"
    },
    {
      "id": "tmdb:812583",
      "type": "movie",
      "name": "Wake Up Dead Man: A Knives Out Mystery",
      "description": "When young priest Jud Duplenticy is sent to assist charismatic firebrand Monsignor Jefferson Wicks, it’s clear that all is not well in the pews. After a sudden and seemingly impossible murder rocks the town, the lack of an obvious suspect prompts local police chief Geraldine Scott to join forces with renowned detective Benoit Blanc to unravel a mystery that defies all logic.",
      "poster": "https://image.tmdb.org/t/p/w500/qCOGGi8JBVEZMc3DVby8rUivyXz.jpg",
      "releaseInfo": "2025-10-08"
    },
    {
      "id": "tmdb:1547527",
      "type": "movie",
      "name": "Stay",
      "description": "Kiara, a PhD author on African spirituality, and Miles, a former MMA fighter turned trainer, facing the end of their marriage. They encounter supernatural forces and go from fighting one another to fighting for their lives. To survive, they must conquer darkness with love.",
      "poster": "https://image.tmdb.org/t/p/w500/kRMzvzxjClWJn7bQtaRLQ2qhb6c.jpg",
      "releaseInfo": "2025-10-08"
    },
    {
      "id": "tmdb:1352755",
      "type": "movie",
      "name": "Maintenance Required",
      "description": "Charlie, the fiercely independent owner of an all-female mechanic shop, is forced to reevaluate her future when a flashy corporate competitor moves in across the street. Seeking comfort, she turns to an anonymous online confidant - unaware she's confiding in Beau, the very rival threatening her business. As sparks fly both online and off, the truth threatens to blow everything apart.",
      "poster": "https://image.tmdb.org/t/p/w500/lM7Q1y0pmHPWZCPmGkAWGKdgu6W.jpg",
      "releaseInfo": "2025-10-08"
    },
    {
      "id": "tmdb:1551336",
      "type": "movie",
      "name": "Matt McCusker: A Humble Offering",
      "description": "From wife logic to locker-room shame, Matt McCusker offers witty takes on manhood, marriage and raising daughters in a world he barely understands.",
      "poster": "https://image.tmdb.org/t/p/w500/aj5H3NXD83lGfUWPgeuuyMOpuRj.jpg",
      "releaseInfo": "2025-10-07"
    },
    {
      "id": "tmdb:1508191",
      "type": "movie",
      "name": "Ozzy: No Escape from Now",
      "description": "Ozzy Osbourne faces his identity and mortality after his world stops. Dealing with health issues and Parkinson's, he questions if he can perform again while music remains his life's cornerstone.",
      "poster": "https://image.tmdb.org/t/p/w500/7xlmn0xpEYiqGN7bINAbEUjNqbr.jpg",
      "releaseInfo": "2025-10-07"
    },
    {
      "id": "tmdb:1464773",
      "type": "movie",
      "name": "Borley Rectory: The Awakening",
      "description": "In 1900, young Reverend Henry Bull and his sister, Kitty, are tasked with taking over the duties of their family home in Essex, a majestic Victorian mansion built on the site of an old monastery. Unaware of the sinister forces that lurk within, the pair are soon confronted by terrifying paranormal activities that threaten their loved ones. Desperate to protect themselves from the demonic intrusion, they call upon the services of a trusted family friend to investigate the origins of the vengeful ghosts which haunt their property. But these are spirits who will not rest, and Borley Rectory is doomed to gain a chilling reputation, as the most haunted house in all of Britain.",
      "poster": "https://image.tmdb.org/t/p/w500/vutdW9lp7XbqlWwKknVN2k3JW7R.jpg",
      "releaseInfo": "2025-10-07"
    },
    {
      "id": "tmdb:1317288",
      "type": "movie",
      "name": "Marty Supreme",
      "description": "In 1950s New York, Marty Mauser, a young man with a dream no one respects, goes to Hell and back in pursuit of greatness.",
      "poster": "https://image.tmdb.org/t/p/w500/firAhZA0uQvRL2slp7v3AnOj0ZX.jpg",
      "releaseInfo": "2025-10-06"
    },
    {
      "id": "tmdb:1114967",
      "type": "movie",
      "name": "Good Fortune",
      "description": "A well-meaning but rather inept angel named Gabriel meddles in the lives of a struggling gig worker and a wealthy capitalist.",
      "poster": "https://image.tmdb.org/t/p/w500/r83HIGA0mUiy7I9qVr17pF7SCDP.jpg",
      "releaseInfo": "2025-10-06"
    },
    {
      "id": "tmdb:533533",
      "type": "movie",
      "name": "TRON: Ares",
      "description": "A highly sophisticated Program called Ares is sent from the digital world into the real world on a dangerous mission, marking humankind's first encounter with A.I. beings.",
      "poster": "https://image.tmdb.org/t/p/w500/chpWmskl3aKm1aTZqUHRCtviwPy.jpg",
      "releaseInfo": "2025-10-06"
    },
    {
      "id": "tmdb:1546050",
      "type": "movie",
      "name": "Lone Samurai",
      "description": "A violent and reckless samurai is shipwrecked on a remote island left without an avenue for his rage. After undertaking a spiritual journey to appease his aggressive thoughts, he finds himself abducted by external demons taking the form of cannibals, putting his sense of reality and deadly talents to the test.",
      "poster": "https://image.tmdb.org/t/p/w500/lwKD20JbeZAX4BswSlWKpmB8Qke.jpg",
      "releaseInfo": "2025-10-05"
    },
    {
      "id": "tmdb:1517758",
      "type": "movie",
      "name": "Stiller & Meara: Nothing Is Lost",
      "description": "Ben Stiller tells the story of his parents—comedy icons Jerry Stiller and Anne Meara—exploring their impact on popular culture and at home, where the lines between creativity, family, life, and art often blurred.",
      "poster": "https://image.tmdb.org/t/p/w500/zJuzuanxfc7D7Kqz4qYQqsDhRY3.jpg",
      "releaseInfo": "2025-10-05"
    },
    {
      "id": "tmdb:1287322",
      "type": "movie",
      "name": "Christy",
      "description": "Christy Martin never imagined life beyond her small-town roots in West Virginia—until she discovered a knack for punching people. Fueled by grit, raw determination, and an unshakable desire to win, she charges into the world of boxing under the guidance of her trainer and manager-turned-husband, Jim. But while Christy flaunts a fiery persona in the ring, her toughest battles unfold outside it—confronting family, identity, and a relationship that just might become life-or-death.",
      "poster": "https://image.tmdb.org/t/p/w500/ssy1uHGZkuXLkIWJWrtsBczPvVC.jpg",
      "releaseInfo": "2025-10-04"
    },
    {
      "id": "tmdb:1465560",
      "type": "movie",
      "name": "Put Your Soul on Your Hand and Walk",
      "description": "An Iranian filmmaker participates in a series of video calls with a young Palestinian photojournalist who describes her life confined in Gaza during the current regional conflict.",
      "poster": "https://image.tmdb.org/t/p/w500/vrEDz3kBG6AZKF3aiaQJB0Qgp8a.jpg",
      "releaseInfo": "2025-10-04"
    },
    {
      "id": "tmdb:1159206",
      "type": "movie",
      "name": "Father Mother Sister Brother",
      "description": "Three stories concerning the relationships between adult children, their somewhat distant parent (or parents), and each other: a reclusive father visited by his grown children in the US, sisters visiting their novelist mother in Dublin, and adult twins called back to their Paris apartment to address a family tragedy.",
      "poster": "https://image.tmdb.org/t/p/w500/zewZA6sL52YSH8xIH4wbG5GadjV.jpg",
      "releaseInfo": "2025-10-03"
    },
    {
      "id": "tmdb:1259102",
      "type": "movie",
      "name": "Eternity",
      "description": "In an afterlife where souls have one week to decide where to spend eternity, Joan is faced with the impossible choice between the man she spent her life with and her first love, who died young and has waited decades for her to arrive.",
      "poster": "https://image.tmdb.org/t/p/w500/o8pg20G67BGmQvRkXwstNre062J.jpg",
      "releaseInfo": "2025-10-03"
    },
    {
      "id": "tmdb:1554419",
      "type": "movie",
      "name": "Match",
      "description": "After Paola is matched with a handsome online suitor, she arrives for a first date to discover a house full of dark and terrifying secrets.",
      "poster": "https://image.tmdb.org/t/p/w500/kCJGLANqs90OZcaUkAClhBLyoDZ.jpg",
      "releaseInfo": "2025-10-03"
    },
    {
      "id": "tmdb:1332316",
      "type": "movie",
      "name": "Scurry",
      "description": "Two strangers find themselves trapped underground when the city is attacked by a monstrous threat. Badly injured with limited resources they must navigate a treacherous, narrowing tunnel in hopes of finding an exit.",
      "poster": "https://image.tmdb.org/t/p/w500/tu7M6zojJPtgPUXnTcN9eBoWxOh.jpg",
      "releaseInfo": "2025-10-03"
    },
    {
      "id": "tmdb:1098534",
      "type": "movie",
      "name": "Orwell: 2+2=5",
      "description": "George Orwell was one of the most visionary authors of the 20th century, whose novels 1984 and Animal Farm foretold a chilling, authoritarian future. Acclaimed director Raoul Peck interweaves clips, readings from Orwell's diary, cinematic references, and modern-day footage to craft not only a portrait of the writer, but a fresh take on how prophetic his work has become.",
      "poster": "https://image.tmdb.org/t/p/w500/qG1LjcK8ohi4mSJ9j8KHUs5svbe.jpg",
      "releaseInfo": "2025-10-03"
    },
    {
      "id": "tmdb:1556398",
      "type": "movie",
      "name": "Famous Last Words: Dr. Jane Goodall",
      "description": "Dr. Jane Goodall connected humanity and nature in unprecedented ways. In this deeply personal interview, she shares her final message with the world.",
      "poster": "https://image.tmdb.org/t/p/w500/ypfl5VYRkeZ3HVM64HxOKriloe4.jpg",
      "releaseInfo": "2025-10-03"
    },
    {
      "id": "tmdb:760329",
      "type": "movie",
      "name": "The Smashing Machine",
      "description": "In the late 1990s, up-and-coming mixed martial artist Mark Kerr aspires to become the greatest fighter in the world. However, he must also battle his opioid dependence and a volatile relationship with his girlfriend Dawn.",
      "poster": "https://image.tmdb.org/t/p/w500/mPuBDGrVIBGOymBxR6rO3iIvBSe.jpg",
      "releaseInfo": "2025-10-03"
    },
    {
      "id": "tmdb:941109",
      "type": "movie",
      "name": "Play Dirty",
      "description": "Expert thief Parker gets a shot at a major heist, but to pull it off he and his team must outsmart a South American dictator, the New York mob, and the world's richest man.",
      "poster": "https://image.tmdb.org/t/p/w500/ovZ0zq0NwRghtWI1oLaM0lWuoEw.jpg",
      "releaseInfo": "2025-10-01"
    },
    {
      "id": "tmdb:1043197",
      "type": "movie",
      "name": "Dust Bunny",
      "description": "Ten-year-old Aurora asks her hitman neighbor to kill the monster she believes ate her entire family. To protect her, he'll need to battle an onslaught of assassins while accepting the fact that some monsters are real.",
      "poster": "https://image.tmdb.org/t/p/w500/jMcT1Quf34qZWNNE1rAqep8f9DW.jpg",
      "releaseInfo": "2025-09-30"
    },
    {
      "id": "tmdb:1480295",
      "type": "movie",
      "name": "Affinity",
      "description": "Chilean martial-arts star Marko Zaror is Bruno, an ex-SEAL struggling with PTSD. He lives a life in fear of his demons until one day when he discovers a beautiful woman with no past of her own. Together they begin to build a life, but when she disappears, Bruno must return to his violent past if he’s going to save her from a shocking conspiracy.",
      "poster": "https://image.tmdb.org/t/p/w500/WKwQOPh2mQPRL12jSu2yFHk4A7.jpg",
      "releaseInfo": "2025-09-30"
    },
    {
      "id": "tmdb:1538258",
      "type": "movie",
      "name": "Earthquake: Joke Telling Business",
      "description": "From unpacking celebrity scandals to hot takes on love, legendary comic Earthquake shakes things up in this explosive stand-up set.",
      "poster": "https://image.tmdb.org/t/p/w500/l3jVHS7xjeSbC69DFc0EQwWMJHs.jpg",
      "releaseInfo": "2025-09-30"
    },
    {
      "id": "tmdb:1364608",
      "type": "movie",
      "name": "Anemone",
      "description": "Middle-aged Jem sets out from his suburban home on a journey into the woods, where he reconnects with his estranged hermit brother Ray. Bonded by a mysterious, complicated past, the men share a fraught, if occasionally tender relationship—one that was forever altered by shattering events decades earlier.",
      "poster": "https://image.tmdb.org/t/p/w500/kXFHVJqZkWtkSRlLpv2clN8KP6E.jpg",
      "releaseInfo": "2025-09-28"
    },
    {
      "id": "tmdb:1290159",
      "type": "movie",
      "name": "A House of Dynamite",
      "description": "When a single, unattributed missile is launched at the United States, a race begins to determine who is responsible and how to respond.",
      "poster": "https://image.tmdb.org/t/p/w500/AiJ8L90ftPAwVf3SDx7Fj9IMZoy.jpg",
      "releaseInfo": "2025-09-28"
    },
    {
      "id": "tmdb:1524554",
      "type": "movie",
      "name": "Adventures in Love & Birding",
      "description": "A single mom agrees to be the partner of a bird enthusiast for a birding competition but misunderstands the assignment and tells everyone she's his new girlfriend instead of just his teammate.",
      "poster": "https://image.tmdb.org/t/p/w500/5djYq3z6wEmke5LHkB7DHZNPF5y.jpg",
      "releaseInfo": "2025-09-27"
    },
    {
      "id": "tmdb:1235192",
      "type": "movie",
      "name": "Wormtown",
      "description": "One year into a plague of flesh-eating, mind-altering worms, the nocturnal town of Ashland, Ohio, has embraced the parasites’ rule. Under cult-like Mayor Joshua, zealous Ranchers spread their gospel—by persuasion or by force. A trio of uninfected women cling to survival through scavenging, extreme hygiene, and evasion. But everyone breaks eventually, unleashing betrayal, sacrilege, and body horror.",
      "poster": "https://image.tmdb.org/t/p/w500/lE10ww38b7XA5LIagIsVQj9a8Hn.jpg",
      "releaseInfo": "2025-09-27"
    },
    {
      "id": "tmdb:1265063",
      "type": "movie",
      "name": "After the Hunt",
      "description": "A college professor finds herself at a personal and professional crossroads when a star pupil levels an accusation against one of her colleagues, and a dark secret from her own past threatens to come to light.",
      "poster": "https://image.tmdb.org/t/p/w500/ryF8QPGUGlo8gRB4OYKb4J0r3aJ.jpg",
      "releaseInfo": "2025-09-26"
    },
    {
      "id": "tmdb:1200320",
      "type": "movie",
      "name": "Killing Faith",
      "description": "In the summer of 1859, a widowed physician reluctantly agrees to take a recently freed slave and her mysterious Caucasian daughter on a five-day journey through the bloody West to find a distant town's Faith Healer. The woman believes her daughter is possessed. The doctor believes she simply carries The Sickness. Either way the fact remains that every living thing the girl touches mysteriously dies.",
      "poster": "https://image.tmdb.org/t/p/w500/bNHlTTdpdDv8xxrXF3krVghyCcj.jpg",
      "releaseInfo": "2025-09-26"
    },
    {
      "id": "tmdb:1399457",
      "type": "movie",
      "name": "The Man with the Black Umbrella",
      "description": "On January 8th, 2015, a man with a black umbrella broke into 818 Hilltop Drive at 3:38a.m., committing a double murder.  The investigation that ensued proved that some murders shouldn’t be solved.",
      "poster": "https://image.tmdb.org/t/p/w500/inSk8zJig5cCBI0HytXY71mQNpf.jpg",
      "releaseInfo": "2025-09-26"
    },
    {
      "id": "tmdb:1530875",
      "type": "movie",
      "name": "All the Devils Are Here",
      "description": "After a heist, four criminals lay low in a remote safehouse, waiting for orders. As paranoia builds, one thing becomes clear — the real threat may not be outside, but among them.",
      "poster": "https://image.tmdb.org/t/p/w500/4GJTUSjbCGynQo4PpTTNzzxYfBM.jpg",
      "releaseInfo": "2025-09-26"
    },
    {
      "id": "tmdb:1371189",
      "type": "movie",
      "name": "Ruth & Boaz",
      "description": "A talented singer leaves the Atlanta music scene and starts over in small-town Tennessee, where she finds love and new purpose but can't escape the past.",
      "poster": "https://image.tmdb.org/t/p/w500/mtMJEIHjeHcLtvP0tFPAptk1Var.jpg",
      "releaseInfo": "2025-09-26"
    },
    {
      "id": "tmdb:1235746",
      "type": "movie",
      "name": "Dead of Winter",
      "description": "A widowed fisherwoman, travelling alone through snowbound northern Minnesota, interrupts the kidnapping of a teenage girl. Hours from the nearest town and with no phone service, she realizes that she is the young girl's only hope.",
      "poster": "https://image.tmdb.org/t/p/w500/5DcrN62sGAiRJxt8rXSRlSRLwIE.jpg",
      "releaseInfo": "2025-09-26"
    },
    {
      "id": "tmdb:1280282",
      "type": "movie",
      "name": "Gabby's Dollhouse: The Movie",
      "description": "Gabby heads out on a road trip with her Grandma Gigi to the urban wonderland of Cat Francisco. But when Gabby's dollhouse, her most prized possession, ends up in the hands of an eccentric cat lady named Vera, Gabby sets off on an adventure through the real world to get the Gabby Cats back together and save the dollhouse before it's too late.",
      "poster": "https://image.tmdb.org/t/p/w500/t6LLguAmu6iZUN8pWhT7Q0IcaQ5.jpg",
      "releaseInfo": "2025-09-26"
    },
    {
      "id": "tmdb:1280450",
      "type": "movie",
      "name": "Stolen Girl",
      "description": "In 1993, Maureen’s six-year-old daughter Amina is snuck out of the country by her ex-husband, Karim. After years of unsuccessful attempts to find her, Maureen intersects with a professional retriever of internationally abducted children who promises to help her find Amina in exchange for her collaboration.",
      "poster": "https://image.tmdb.org/t/p/w500/fZlNXEHZsBp7unqw009MeBbMv87.jpg",
      "releaseInfo": "2025-09-26"
    },
    {
      "id": "tmdb:1319965",
      "type": "movie",
      "name": "All of You",
      "description": "Laura and Simon have been best friends since college. Over the years, they've realized their bond is more than platonic. Can they—and should they—risk everything to explore a love that has existed all along?",
      "poster": "https://image.tmdb.org/t/p/w500/U2KFjtXN9NL9eCENB28w42Jakp.jpg",
      "releaseInfo": "2025-09-25"
    },
    {
      "id": "tmdb:1212271",
      "type": "movie",
      "name": "Eleanor the Great",
      "description": "94-year-old Eleanor Morgenstein tries to rebuild her life after the death of her best friend. As a result, she moves back to New York City after living in Florida for decades.",
      "poster": "https://image.tmdb.org/t/p/w500/9XTM42IJST6lwPxtK2iUwNaFvCT.jpg",
      "releaseInfo": "2025-09-24"
    },
    {
      "id": "tmdb:1242419",
      "type": "movie",
      "name": "Roofman",
      "description": "A former Army Ranger and struggling father turns to robbing McDonald’s restaurants by cutting holes in their roofs, earning him the nickname 'Roofman'. After escaping prison, he secretly lives inside a Toys “R” Us for six months, surviving undetected while planning his next move. But when he falls for a divorced mom drawn to his undeniable charm, his double life begins to unravel, setting off a compelling and suspenseful game of cat and mouse as his past closes in.",
      "poster": "https://image.tmdb.org/t/p/w500/wXDFtcnYtevleGzCmAD2ReQnJ4l.jpg",
      "releaseInfo": "2025-09-23"
    },
    {
      "id": "tmdb:1533898",
      "type": "movie",
      "name": "Cristela Alonzo: Upper Classy",
      "description": "Cristela seeks joy through various experiences - outdoing her old bully, overdoing spa treatments, and taking her first family vacation - while teaching everyone to embrace life's pleasures.",
      "poster": "https://image.tmdb.org/t/p/w500/fCJmbhhLOGeZIftbYBjWZ4VrU3o.jpg",
      "releaseInfo": "2025-09-23"
    },
    {
      "id": "tmdb:801937",
      "type": "movie",
      "name": "Silent Night, Deadly Night",
      "description": "After witnessing his parents’ brutal murder on Christmas Eve, Billy transforms into a Killer Santa, delivering a yearly spree of calculated, chilling violence. This year, his blood-soaked mission collides with love, as a young woman challenges him to confront his darkness.",
      "poster": "https://image.tmdb.org/t/p/w500/xCdSd7NnRdnL8DGLVhI95WhUNoi.jpg",
      "releaseInfo": "2025-09-21"
    },
    {
      "id": "tmdb:1314862",
      "type": "movie",
      "name": "Lilith Fair: Building a Mystery",
      "description": "Behind the scenes of Sarah McLachlan’s legendary all-women music festival and features interviews with performers including Bonnie Raitt, Erykah Badu, Olivia Rodrigo, and Emmylou Harris.",
      "poster": "https://image.tmdb.org/t/p/w500/PCI5HmNXRb9gx8BYTIUbThaymz.jpg",
      "releaseInfo": "2025-09-21"
    },
    {
      "id": "tmdb:1197137",
      "type": "movie",
      "name": "Black Phone 2",
      "description": "Four years after escaping The Grabber, Finney Blake is struggling with his life after captivity. When his sister Gwen begins receiving calls in her dreams from the black phone and seeing disturbing visions of three boys being stalked at a winter camp, the siblings become determined to solve the mystery and confront a killer who has grown more powerful in death and more significant to them than either could imagine.",
      "poster": "https://image.tmdb.org/t/p/w500/gFddBLQ8wj9M9O82iPzgX5KVNHz.jpg",
      "releaseInfo": "2025-09-20"
    },
    {
      "id": "tmdb:1253000",
      "type": "movie",
      "name": "Deathstalker",
      "description": "A powerful swordsman known as Deathstalker recovers a cursed amulet from a corpse-strewn battlefield. Marked by dark magic and hunted by monstrous assassins, he must face the rising evil and break the curse.",
      "poster": "https://image.tmdb.org/t/p/w500/nEI3DnzQC1afAjJOAizx6UX27pL.jpg",
      "releaseInfo": "2025-09-20"
    },
    {
      "id": "tmdb:1386827",
      "type": "movie",
      "name": "Coyotes",
      "description": "Trapped in their Hollywood Hills home, a family fights for survival when caught between a raging wildfire and a pack of savage coyotes.",
      "poster": "https://image.tmdb.org/t/p/w500/fSzs9ZXYcrln0FRrjGIPCjuB6En.jpg",
      "releaseInfo": "2025-09-20"
    },
    {
      "id": "tmdb:1010756",
      "type": "movie",
      "name": "The Strangers: Chapter 2",
      "description": "When The Strangers learn that one of their victims, Maya, is still alive, they return to finish what they’ve started.",
      "poster": "https://image.tmdb.org/t/p/w500/aEk9jLbiKTVssdATbrF879NvyyJ.jpg",
      "releaseInfo": "2025-09-20"
    },
    {
      "id": "tmdb:1568056",
      "type": "movie",
      "name": "Mirror Life",
      "description": "Amidst a pandemic, a woman documents the search for her cousin who disappeared after entering a clinical trial for an experimental miracle drug called Dumitor.",
      "poster": "https://image.tmdb.org/t/p/w500/lCj96toltQ5uMcIezuEO8cb0kb2.jpg",
      "releaseInfo": "2025-09-20"
    },
    {
      "id": "tmdb:1244531",
      "type": "movie",
      "name": "Beast of War",
      "description": "When their boat sinks while crossing the Timor Sea during World War II, a troop of young Australian soldiers must find a way to survive the harsh seas on a quickly shrinking raft. Hundreds of miles from anywhere, they must confront interpersonal conflicts, enemy attacks, and the advances of one very large, very hungry great white shark.",
      "poster": "https://image.tmdb.org/t/p/w500/2xgDjVEOtu5LlbPEngxfbCqWEFg.jpg",
      "releaseInfo": "2025-09-20"
    },
    {
      "id": "tmdb:997113",
      "type": "movie",
      "name": "Hedda",
      "description": "Hedda Gabler finds herself torn between the lingering ache of a past love and the quiet suffocation of her present life. Over the course of one charged night, long-repressed desires and hidden tensions erupt—pulling her and everyone around her into a spiral of manipulation, passion, and betrayal.",
      "poster": "https://image.tmdb.org/t/p/w500/ecflk7AZf0ij205yDswjlvdxlCO.jpg",
      "releaseInfo": "2025-09-19"
    },
    {
      "id": "tmdb:937941",
      "type": "movie",
      "name": "Shelby Oaks",
      "description": "A woman's obsessive search for her missing sister leads her into a terrifying mystery at the hands of an unknown evil.",
      "poster": "https://image.tmdb.org/t/p/w500/i3omY4P6QUzFQlEeclWY92RuXCH.jpg",
      "releaseInfo": "2025-09-19"
    },
    {
      "id": "tmdb:1544122",
      "type": "movie",
      "name": "Takeout",
      "description": "On a dead-end night shift at a remote fast food diner, three co-workers suspect a customer is a serial killer. After digging for proof, they quickly realize they're in over their heads.",
      "poster": "https://image.tmdb.org/t/p/w500/3cM00rluhzLm4fGXHXLTksYkTPQ.jpg",
      "releaseInfo": "2025-09-19"
    },
    {
      "id": "tmdb:1541013",
      "type": "movie",
      "name": "Caleb Hearon: Model Comedian",
      "description": "​In his debut stand-up special, actor, comedian, writer, and podcaster Caleb Hearon takes us back to his roots in Kansas City...where it all started. Newly 30, Hearon deploys his generational Midwestern wisdom to solve most of the world's problems: politics, internet trolls, learning we're not that different from our parents, and more.",
      "poster": "https://image.tmdb.org/t/p/w500/cUuBlSqicvZO1wtF0yyZbqiXIlR.jpg",
      "releaseInfo": "2025-09-19"
    },
    {
      "id": "tmdb:1381066",
      "type": "movie",
      "name": "In Whose Name?",
      "description": "Over six years, 18-year-old Nico Ballesteros captured an unfiltered portrait of Ye, formerly known as Kanye West, offering unprecedented access into the private and public life of one of the most controversial figures in modern culture.",
      "poster": "https://image.tmdb.org/t/p/w500/2snBAd7RIQucxN1Np3kRpZtRdN8.jpg",
      "releaseInfo": "2025-09-19"
    },
    {
      "id": "tmdb:1373445",
      "type": "movie",
      "name": "V/H/S/Halloween",
      "description": "A collection of Halloween-themed videotapes unleashes a series of twisted, blood-soaked tales, turning trick-or-treat into a struggle for survival.",
      "poster": "https://image.tmdb.org/t/p/w500/bvMKSZtN8KAdtlKoYbEi1Zhyaou.jpg",
      "releaseInfo": "2025-09-19"
    },
    {
      "id": "tmdb:1328803",
      "type": "movie",
      "name": "Prisoner of War",
      "description": "British RAF Wing Commander James Wright is captured by the Japanese during WWII and forced to fight in brutal hand-to-hand combat. The Japanese soldiers get more than they bargained for when Wright’s years of martial arts training in Hong Kong prove him to be a formidable opponent.",
      "poster": "https://image.tmdb.org/t/p/w500/1XET89sjRm9mUuHXhGIlKTNd5uD.jpg",
      "releaseInfo": "2025-09-19"
    },
    {
      "id": "tmdb:1251717",
      "type": "movie",
      "name": "Vicious",
      "description": "When Polly receives a mysterious box, it comes with one rule: place inside something she needs, something she hates, and something she loves. If she doesn’t obey, it will consume everything—and everyone—she’s ever known.",
      "poster": "https://image.tmdb.org/t/p/w500/shKGDGrwqmc9x2aTJcQszoXinq0.jpg",
      "releaseInfo": "2025-09-19"
    },
    {
      "id": "tmdb:1242404",
      "type": "movie",
      "name": "Steve",
      "description": "Over one intense day, the devoted head teacher of a last-chance reform school strives to keep his students in line while facing pressures of his own.",
      "poster": "https://image.tmdb.org/t/p/w500/wmLoMyofbseLfxiGgk1Iz5H97c3.jpg",
      "releaseInfo": "2025-09-19"
    },
    {
      "id": "tmdb:1236470",
      "type": "movie",
      "name": "The Lost Bus",
      "description": "A determined father risks everything to rescue a dedicated teacher and her students from a raging wildfire.",
      "poster": "https://image.tmdb.org/t/p/w500/zpygCOYY1DPBkeUsrrznLRN5js5.jpg",
      "releaseInfo": "2025-09-19"
    },
    {
      "id": "tmdb:1119377",
      "type": "movie",
      "name": "Xeno",
      "description": "A teenage girl develops an otherworldly bond with an alien after it crash-lands in the desert. As government agents close in, she must protect her new friend, while uncovering a secret that could change the fate of both their worlds.",
      "poster": "https://image.tmdb.org/t/p/w500/a173ryH3yQXvP2y0jriL3dYjWfX.jpg",
      "releaseInfo": "2025-09-19"
    },
    {
      "id": "tmdb:1083420",
      "type": "movie",
      "name": "Adulthood",
      "description": "The lives of two siblings are completely upended when they discover a dead body, long buried in their parent’s basement, sending them down a rabbit hole of crime and murder.",
      "poster": "https://image.tmdb.org/t/p/w500/a40Gi0Zq4Ecqu3obmOp6TSgEne1.jpg",
      "releaseInfo": "2025-09-19"
    },
    {
      "id": "tmdb:574452",
      "type": "movie",
      "name": "Waltzing with Brando",
      "description": "The story of how Marlon Brando plucked Bernard Judge, an obscure but idealistic Los Angeles architect from his stable existence and convinced him that he should build the world’s first ecologically perfect retreat on a tiny and uninhabitable Tahitian island.",
      "poster": "https://image.tmdb.org/t/p/w500/iCMOHK9k8MIm95xCCKFwdIZkNc6.jpg",
      "releaseInfo": "2025-09-19"
    },
    {
      "id": "tmdb:1217602",
      "type": "movie",
      "name": "London Calling",
      "description": "After fleeing the UK from a job gone wrong, a down on his luck hitman is forced to babysit the son of his new crime boss and show him how to become a man.",
      "poster": "https://image.tmdb.org/t/p/w500/cpQ4VxBJO7vGV3IUdKzSNf4tH9V.jpg",
      "releaseInfo": "2025-09-19"
    },
    {
      "id": "tmdb:1241921",
      "type": "movie",
      "name": "A Big Bold Beautiful Journey",
      "description": "Sarah and David are single strangers who meet at a mutual friend’s wedding and soon, through a surprising twist of fate, find themselves on a funny, fantastical, sweeping adventure together where they get to re-live important moments from their respective pasts, illuminating how they got to where they are in the present... and possibly getting a chance to alter their futures.",
      "poster": "https://image.tmdb.org/t/p/w500/uMAkmQlKthQpTMiyPAKOYK3JnMs.jpg",
      "releaseInfo": "2025-09-19"
    },
    {
      "id": "tmdb:1265344",
      "type": "movie",
      "name": "Swiped",
      "description": "Whitney Wolfe uses extraordinary grit and ingenuity to break into the male-dominated tech industry.",
      "poster": "https://image.tmdb.org/t/p/w500/mEeFRU5ADkyP7JtOFFV8tYMm3zD.jpg",
      "releaseInfo": "2025-09-19"
    },
    {
      "id": "tmdb:507244",
      "type": "movie",
      "name": "Afterburn",
      "description": "Set against the backdrop of a postapocalyptic Earth whose Eastern Hemisphere was destroyed by a massive solar flare, leaving what life remains mutated from radiation and fallout. The story revolves around a group of treasure hunters who extract such objects as the Mona Lisa, the Rosetta Stone and the Crown Jewels while facing rival hunters, mutants and pirates.",
      "poster": "https://image.tmdb.org/t/p/w500/hrze9JXp2QJpc2WjLfSUtRxyYSb.jpg",
      "releaseInfo": "2025-09-19"
    },
    {
      "id": "tmdb:1541827",
      "type": "movie",
      "name": "Dolphins Up Close with Bertie Gregory",
      "description": "Bertie Gregory heads to the Azores, a vital marine sanctuary and seasonal hotspot for migrating ocean predators. During feeding season, thousands of elusive hunters gather to feast on massive bait balls. Battling storms and scanning vast seas, Bertie races against time to capture the most epic feeding frenzy of his career.",
      "poster": "https://image.tmdb.org/t/p/w500/oCuxThFeyca7HiWK5qQ7wVNQmYH.jpg",
      "releaseInfo": "2025-09-18"
    },
    {
      "id": "tmdb:986097",
      "type": "movie",
      "name": "HIM",
      "description": "After suffering a potentially career-ending brain trauma, Cameron Cade receives a lifeline when his hero, legendary eight-time Championship quarterback and cultural megastar Isaiah White, offers to train Cam at Isaiah's isolated compound that he shares with his celebrity influencer wife. But as Cam's training accelerates, Isaiah's charisma begins to curdle into something darker.",
      "poster": "https://image.tmdb.org/t/p/w500/qPJzcYR2f1O1uynYBCVPPJuOiAH.jpg",
      "releaseInfo": "2025-09-17"
    },
    {
      "id": "tmdb:1535385",
      "type": "movie",
      "name": "Rebel Royals: An Unlikely Love Story",
      "description": "Go behind the scenes of Märtha Louise and Shaman Durek Verrett's relationship in the lead-up to their divisive wedding in Norway.",
      "poster": "https://image.tmdb.org/t/p/w500/7vIkk6WNThpI89dyJMZ8IFrIz7n.jpg",
      "releaseInfo": "2025-09-16"
    },
    {
      "id": "tmdb:1519168",
      "type": "movie",
      "name": "The Jester 2",
      "description": "When teen magician Max crosses paths with the sinister Jester on Halloween night, she must outsmart a supernatural killer whose magic is all too real and whose tricks always end up in blood.",
      "poster": "https://image.tmdb.org/t/p/w500/47dsw1jSOV0Be5zmy7CtLhYpqU.jpg",
      "releaseInfo": "2025-09-15"
    },
    {
      "id": "tmdb:1458530",
      "type": "movie",
      "name": "Mystery Island: House Rules",
      "description": "Mystery Island success raises plans of expansion, and the Island team meets their Mystery Mountain counterparts for a friendly murder game, but the fun ends with a murder in plain sight.",
      "poster": "https://image.tmdb.org/t/p/w500/4y2a2UwrVnMtBEVawuKNEgrSAEh.jpg",
      "releaseInfo": "2025-09-14"
    },
    {
      "id": "tmdb:1526215",
      "type": "movie",
      "name": "Love+War",
      "description": "Pulitzer Prize-winning conflict photojournalist Lynsey Addario reflects on a career working in some of the world's most dangerous war zones, including the Russian invasion of Ukraine.",
      "poster": "https://image.tmdb.org/t/p/w500/7sr2GJyTZpdv8HvSneDCwRbhmFt.jpg",
      "releaseInfo": "2025-09-12"
    },
    {
      "id": "tmdb:1538876",
      "type": "movie",
      "name": "WWE/AAA Worlds Collide 2025: Las Vegas",
      "description": "Cox Pavilion at the Thomas & Mack Center in the Las Vegas suburb of Paradise, Nevada. The event will feature wrestlers from WWE's Raw, SmackDown, and NXT brand divisions, and from AAA, which WWE acquired in April 2025.",
      "poster": "https://image.tmdb.org/t/p/w500/dpfGTps4QTmWpIsi9PcIohscKag.jpg",
      "releaseInfo": "2025-09-12"
    },
    {
      "id": "tmdb:1161617",
      "type": "movie",
      "name": "Code 3",
      "description": "A burned-out paramedic tries to survive his last 24 hours on the job while training a new recruit.",
      "poster": "https://image.tmdb.org/t/p/w500/gIAYMDb5mIAeCAj76q1sRsKjkzo.jpg",
      "releaseInfo": "2025-09-12"
    },
    {
      "id": "tmdb:957121",
      "type": "movie",
      "name": "The Man in My Basement",
      "description": "Down on his luck, Charles Blakey agrees to rent his basement to a mysterious stranger, unaware he may be letting in a force much darker than he imagined.",
      "poster": "https://image.tmdb.org/t/p/w500/1zpeH8wOrM8p2TTAmBetwhe2BIx.jpg",
      "releaseInfo": "2025-09-12"
    },
    {
      "id": "tmdb:1536975",
      "type": "movie",
      "name": "Andrew Santino: White Noise",
      "description": "Andrew Santino's new hilarious stand-up special will undoubtedly solve all the world's problems for eternity.",
      "poster": "https://image.tmdb.org/t/p/w500/vhTfACqo6a6BYNaoUVjuMWVqfP2.jpg",
      "releaseInfo": "2025-09-12"
    },
    {
      "id": "tmdb:1321439",
      "type": "movie",
      "name": "The Wrong Paris",
      "description": "Dawn thinks she's joining a dating show in Paris, France, only to land in Paris, Texas. She has an exit plan — until sparks fly with the cowboy bachelor.",
      "poster": "https://image.tmdb.org/t/p/w500/A0KRoR842OgNByCfw9iFHbWoeR9.jpg",
      "releaseInfo": "2025-09-12"
    },
    {
      "id": "tmdb:1289936",
      "type": "movie",
      "name": "Downton Abbey: The Grand Finale",
      "description": "When Mary finds herself at the center of a public scandal and the family faces financial strife, the entire household grapples with the threat of social disgrace. The Crawleys must embrace change as the staff prepares for a new chapter with the next generation leading Downton Abbey into the future.",
      "poster": "https://image.tmdb.org/t/p/w500/m1tLlMTCwc6oK6OjWTOI4b32wnA.jpg",
      "releaseInfo": "2025-09-12"
    },
    {
      "id": "tmdb:975225",
      "type": "movie",
      "name": "Spinal Tap II: The End Continues",
      "description": "The now estranged bandmates of Spinal Tap are forced to reunite for one final concert, hoping it will solidify their place in the pantheon of rock 'n' roll.",
      "poster": "https://image.tmdb.org/t/p/w500/h6DGrDHlDm6gVOiy3YeOb737jB4.jpg",
      "releaseInfo": "2025-09-09"
    },
    {
      "id": "tmdb:1535377",
      "type": "movie",
      "name": "Jordan Jensen: Take Me With You",
      "description": "In her hilarious debut special, Jordan Jensen delivers unapologetic takes on failing at femininity, the paradox that is “self love” and the horrors of trying to find it.",
      "poster": "https://image.tmdb.org/t/p/w500/vQ8T0pK0vfjUe5jUiOj6uZHbypJ.jpg",
      "releaseInfo": "2025-09-09"
    },
    {
      "id": "tmdb:1054867",
      "type": "movie",
      "name": "One Battle After Another",
      "description": "Washed-up revolutionary Bob exists in a state of stoned paranoia, surviving off-grid with his spirited, self-reliant daughter, Willa. When his evil nemesis resurfaces after 16 years and she goes missing, the former radical scrambles to find her, father and daughter both battling the consequences of his past.",
      "poster": "https://image.tmdb.org/t/p/w500/m1jFoahEbeQXtx4zArT2FKdbNIj.jpg",
      "releaseInfo": "2025-09-08"
    },
    {
      "id": "tmdb:604079",
      "type": "movie",
      "name": "The Long Walk",
      "description": "In a dystopian, alternate-America ruled by a totalitarian regime, fifty teenage boys take part in a deadly annual walking contest, forced to maintain a minimum pace or be executed, until only one survivor remains.",
      "poster": "https://image.tmdb.org/t/p/w500/wobVTa99eW0ht6c1rNNzLkazPtR.jpg",
      "releaseInfo": "2025-09-08"
    },
    {
      "id": "tmdb:1110775",
      "type": "movie",
      "name": "Behold!",
      "description": "While a husband and wife grapple with the end of their failed marriage, an evil entity manifests within their home.",
      "poster": "https://image.tmdb.org/t/p/w500/msriyC5Uk9iCSCEbNyuVR2Ta4Kf.jpg",
      "releaseInfo": "2025-09-08"
    },
    {
      "id": "tmdb:1355583",
      "type": "movie",
      "name": "Helloween",
      "description": "During the sinister killer clown craze of 2016, Dr. Ellen Marks, aided by investigative journalist John Parker, trace the source of the phenomena to one of her patients - incarcerated, charismatic serial killer Carl Cane, who is using his insidious clown symbolism to recruit an army of the disenfranchised and launch a murderous anarchist movement from London across the globe. With Cane escaped and on the run on October 31st can they stop him before he unleashes hell on earth on Halloween?",
      "poster": "https://image.tmdb.org/t/p/w500/lFPmEa3b3TH1j5ObdiU4F1xqgcg.jpg",
      "releaseInfo": "2025-09-05"
    },
    {
      "id": "tmdb:1314129",
      "type": "movie",
      "name": "Preparation for the Next Life",
      "description": "Aishe, a Uyghur woman trained by her military father, migrates to New York City where she finds herself laboring in Chinatown’s underground kitchens. She fatefully encounters Skinner, a young American soldier who has just returned from three tours in the Middle East. While falling in love, they discover the possibility of a better life together than the ones they believed they were destined to live alone.",
      "poster": "https://image.tmdb.org/t/p/w500/8JbuKgQBc8KlXopF1eege54HNQ5.jpg",
      "releaseInfo": "2025-09-05"
    },
    {
      "id": "tmdb:1267116",
      "type": "movie",
      "name": "Bad Man",
      "description": "In Colt Lake, Tennessee, Sam Evans tackles a meth epidemic. He is side-lined on arrival of Bobby Gaines, an undercover agent. Despite Evans' local ties, Gaines is hailed as hero. Suspicions arise on Gaines which unravels a complex narrative.",
      "poster": "https://image.tmdb.org/t/p/w500/7vIccLLGDhCOkBUCqEEl3a1Yhc1.jpg",
      "releaseInfo": "2025-09-05"
    },
    {
      "id": "tmdb:849192",
      "type": "movie",
      "name": "Pools",
      "description": "Kennedy has one day to get her shit together or get kicked out of school for good. Instead of buckling down, she rallies a ragtag crew for a midnight pool-hopping adventure through the lavish estates of her college town. But under the surface, Kennedy is searching for answers to the questions tearing her up inside in the wake of her father's death. As the secrets spill, this wild escape becomes a cathartic journey of self-discovery.",
      "poster": "https://image.tmdb.org/t/p/w500/3yX8o4LT6TyrjoY2loTyziPuZys.jpg",
      "releaseInfo": "2025-09-05"
    },
    {
      "id": "tmdb:1215798",
      "type": "movie",
      "name": "The Cut",
      "description": "A retired boxer intends to return to the ring for one last shot at the title, but first he must make the weight. Holed up in a room in Las Vegas with an unscrupulous trainer, he embarks on an intensive and illegal weight-cutting program.",
      "poster": "https://image.tmdb.org/t/p/w500/6iseyProRsPyu3rOCzsXDDnDGrl.jpg",
      "releaseInfo": "2025-09-05"
    },
    {
      "id": "tmdb:1038392",
      "type": "movie",
      "name": "The Conjuring: Last Rites",
      "description": "Paranormal investigators Ed and Lorraine Warren take on one last terrifying case involving mysterious entities they must confront.",
      "poster": "https://image.tmdb.org/t/p/w500/byWgphT74ClOVa8EOGzYDkl8DVL.jpg",
      "releaseInfo": "2025-09-05"
    },
    {
      "id": "tmdb:1522103",
      "type": "movie",
      "name": "Blood & Myth",
      "description": "When a series of shocking, violent crimes shatters a remote native village in Northern Alaska, one man embarks on a journey to investigate a frightening paranormal connection.",
      "poster": "https://image.tmdb.org/t/p/w500/7d2gjjwYdaSyLHcdn1DCaE7WREV.jpg",
      "releaseInfo": "2025-09-04"
    },
    {
      "id": "tmdb:1044768",
      "type": "movie",
      "name": "Looking Through Water",
      "description": "William McKay’s successful New York executive career is in ruins after a shocking betrayal. Called by his estranged father, William travels to Belize for a father & son fishing tournament that reopens old wounds and sparks new understanding. Decades later, William recalls that pivotal trip as he tries to connect with his angry, distant grandson.",
      "poster": "https://image.tmdb.org/t/p/w500/Aryl5Y87ynfyrs4U0ktPHJ7XQ5i.jpg",
      "releaseInfo": "2025-09-03"
    },
    {
      "id": "tmdb:1530127",
      "type": "movie",
      "name": "Lookout",
      "description": "Seeking peace away from her turbulent life, a young woman accepts a job as a fire lookout at a remote wilderness tower. As she settles into her new role, eerie disturbances and strange occurrences begin to unfold, and she must uncover the chilling secrets that disrupt her isolation before it’s too late.",
      "poster": "https://image.tmdb.org/t/p/w500/puQMWEXZ9wpqwniz9ac3MTAe6BB.jpg",
      "releaseInfo": "2025-09-02"
    },
    {
      "id": "tmdb:1525091",
      "type": "movie",
      "name": "All the Empty Rooms",
      "description": "A journalist and a photographer set out to memorialize the bedrooms left behind by children killed in school shootings.",
      "poster": "https://image.tmdb.org/t/p/w500/A2sXJBlf3QmzOlpx8J4qIxbq0W5.jpg",
      "releaseInfo": "2025-08-31"
    },
    {
      "id": "tmdb:1069905",
      "type": "movie",
      "name": "Jay Kelly",
      "description": "Famous movie actor Jay Kelly embarks on a journey of self-discovery, confronting both his past and present, accompanied by his devoted manager, Ron.",
      "poster": "https://image.tmdb.org/t/p/w500/bKLm1xS9DsODWB4i1SxTEvLXab9.jpg",
      "releaseInfo": "2025-08-30"
    },
    {
      "id": "tmdb:701387",
      "type": "movie",
      "name": "Bugonia",
      "description": "Two conspiracy obsessed young men kidnap the high-powered CEO of a major company, convinced that she is an alien intent on destroying planet Earth.",
      "poster": "https://image.tmdb.org/t/p/w500/oxgsAQDAAxA92mFGYCZllgWkH9J.jpg",
      "releaseInfo": "2025-08-30"
    },
    {
      "id": "tmdb:1062722",
      "type": "movie",
      "name": "Frankenstein",
      "description": "Dr. Victor Frankenstein, a brilliant but egotistical scientist, brings a creature to life in a monstrous experiment that ultimately leads to the undoing of both the creator and his tragic creation.",
      "poster": "https://image.tmdb.org/t/p/w500/g4JtvGlQO7DByTI6frUobqvSL3R.jpg",
      "releaseInfo": "2025-08-30"
    },
    {
      "id": "tmdb:1283320",
      "type": "movie",
      "name": "Urchin",
      "description": "Mike, a rough sleeper in London, is trapped in a cycle of self-destruction as he attempts to turn his life around. Along the way, he encounters unexpected chances for a fresh start.",
      "poster": "https://image.tmdb.org/t/p/w500/zc8n3hm3S2VxFxlNH1MNN28LVMa.jpg",
      "releaseInfo": "2025-08-30"
    },
    {
      "id": "tmdb:891584",
      "type": "movie",
      "name": "The History of Sound",
      "description": "In 1917, two young music students attending the Boston Conservatory bond over their mutual love of folk music. They reconnect a few years later, embarking on a song collecting trip in the backwaters of Maine.",
      "poster": "https://image.tmdb.org/t/p/w500/5tNr1CySiYQICRsQbWWSSsDiKjn.jpg",
      "releaseInfo": "2025-08-30"
    },
    {
      "id": "tmdb:1537366",
      "type": "movie",
      "name": "Lost in the Jungle",
      "description": "After a deadly plane crash strands four young siblings deep within the Colombian rainforest, a dramatic rescue mission unfolds, uniting Indigenous trackers and the military in a race against time. For the first time ever, this documentay offers the exclusive account of this incredible true story directly from the children themselves and the rescuers who scoured the Amazon rainforest for a grueling 40 days and nights to find them.",
      "poster": "https://image.tmdb.org/t/p/w500/im9oE8b6yAXNGTVwSYFZ5TmXgkc.jpg",
      "releaseInfo": "2025-08-30"
    },
    {
      "id": "tmdb:1287141",
      "type": "movie",
      "name": "Pillion",
      "description": "A timid man is swept off his feet when an enigmatic, impossibly handsome biker takes him on as his submissive.",
      "poster": "https://image.tmdb.org/t/p/w500/5mXwQKAGrtvYzNXkiPbqPxqb2zK.jpg",
      "releaseInfo": "2025-08-29"
    },
    {
      "id": "tmdb:858024",
      "type": "movie",
      "name": "Hamnet",
      "description": "The powerful story of love and loss that inspired the creation of Shakespeare's timeless masterpiece, Hamlet.",
      "poster": "https://image.tmdb.org/t/p/w500/71KNp6RiOQTbs8Fn1DagrFQrZmx.jpg",
      "releaseInfo": "2025-08-29"
    },
    {
      "id": "tmdb:1230368",
      "type": "movie",
      "name": "Springsteen: Deliver Me from Nowhere",
      "description": "Bruce Springsteen, a young musician on the cusp of global superstardom, struggles to reconcile the pressures of success with the ghosts of his past.",
      "poster": "https://image.tmdb.org/t/p/w500/csBV3eq4RDjNg1acNQ8kwOZyPlZ.jpg",
      "releaseInfo": "2025-08-29"
    },
    {
      "id": "tmdb:1299655",
      "type": "movie",
      "name": "Blue Moon",
      "description": "On the evening of March 31, 1943, legendary lyricist Lorenz Hart confronts his shattered self-confidence in Sardi’s bar as his former collaborator Richard Rodgers celebrates the opening night of his ground-breaking hit musical “Oklahoma!”.",
      "poster": "https://image.tmdb.org/t/p/w500/dVU7SNc6dgStTVdtbPLQncWxsyZ.jpg",
      "releaseInfo": "2025-08-29"
    },
    {
      "id": "tmdb:1352624",
      "type": "movie",
      "name": "The Mastermind",
      "description": "In a sedate Massachusetts suburb circa 1970, unemployed family man and amateur art thief J.B. Mooney sets out on his first heist. With the museum cased and accomplices recruited, he has an airtight plan. Or so he thinks.",
      "poster": "https://image.tmdb.org/t/p/w500/oPaEQ3m4zHOzIAstgXCZZtzcHTL.jpg",
      "releaseInfo": "2025-08-29"
    },
    {
      "id": "tmdb:1272166",
      "type": "movie",
      "name": "Ballad of a Small Player",
      "description": "Amid the glittering casinos of Macau, a gambler running from his past—and his debts—becomes fascinated by an enigmatic woman at the baccarat table.",
      "poster": "https://image.tmdb.org/t/p/w500/yiXpXNiBWENaSJmdKfoT5DU0bL4.jpg",
      "releaseInfo": "2025-08-29"
    },
    {
      "id": "tmdb:1290369",
      "type": "movie",
      "name": "Megadoc",
      "description": "Presenting a behind-the-scenes account of a visionary at work. From Oscar-nominated Mike Figgis, Megadoc gives audiences an unfiltered and intimate look at the making of Francis Ford Coppola’s epic sci-fi drama Megalopolis.",
      "poster": "https://image.tmdb.org/t/p/w500/yjiqwnvgst3ntm25L5heBHjqny9.jpg",
      "releaseInfo": "2025-08-29"
    },
    {
      "id": "tmdb:1539746",
      "type": "movie",
      "name": "President Down",
      "description": "A secret message warning that the President's pacemaker is compromised sends her team scrambling to stop an unseen enemy demanding $100M by midnight.",
      "poster": "https://image.tmdb.org/t/p/w500/fGhd4DurS1rhmNOb7b9EeobQTPe.jpg",
      "releaseInfo": "2025-08-29"
    },
    {
      "id": "tmdb:1423024",
      "type": "movie",
      "name": "The New Yorker at 100",
      "description": "Hard-hitting journalism. Era-defining fiction. Witty cartoons. The New Yorker marks its 100th anniversary with this look at its past, present and future.  The New Yorker's centennial reveals behind-the-scenes access to editors, writers, and archives of this culturally vital magazine, one of print's last survivors.",
      "poster": "https://image.tmdb.org/t/p/w500/4vNUHGzIFxI267gFZpq3eM8m0bl.jpg",
      "releaseInfo": "2025-08-29"
    },
    {
      "id": "tmdb:1517772",
      "type": "movie",
      "name": "Unknown Number: The High School Catfish",
      "description": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
      "poster": "https://image.tmdb.org/t/p/w500/nu3LtgefE2lsgYw1hxHZFoBXk9U.jpg",
      "releaseInfo": "2025-08-29"
    },
    {
      "id": "tmdb:1267905",
      "type": "movie",
      "name": "The Roses",
      "description": "Life seems easy for picture-perfect couple Ivy and Theo: successful careers, a loving marriage, great kids. But beneath the façade of their supposed ideal life, a storm is brewing – as Theo's career nosedives while Ivy's own ambitions take off, a tinderbox of fierce competition and hidden resentment ignites.",
      "poster": "https://image.tmdb.org/t/p/w500/98n5HnCJ5LnXKIMNP9SBfVNyxCE.jpg",
      "releaseInfo": "2025-08-29"
    },
    {
      "id": "tmdb:1245993",
      "type": "movie",
      "name": "Caught Stealing",
      "description": "Burned-out ex-baseball player Hank Thompson unexpectedly finds himself embroiled in a dangerous struggle for survival amidst the criminal underbelly of late 1990s New York City, forced to navigate a treacherous underworld he never imagined.",
      "poster": "https://image.tmdb.org/t/p/w500/cvda8s5J8YaHjTyEyXQpvD6f3iV.jpg",
      "releaseInfo": "2025-08-29"
    },
    {
      "id": "tmdb:1494409",
      "type": "movie",
      "name": "Imported",
      "description": "After a lifelong dream of playing in the NBA is dashed, and on the brink of their athletic prime, three athletes discover unexpected growth and success as international ballers when they decide to play overseas. Immersing themselves in foreign cultures while discovering the intense and exhilarating global fandom for basketball, these athletes turn an unwanted detour into a transformative and fulfilling chapter in the pursuit of their dreams.",
      "poster": "https://image.tmdb.org/t/p/w500/mWzjWop4AqqAHBmLN2kYFMYqGgW.jpg",
      "releaseInfo": "2025-08-28"
    },
    {
      "id": "tmdb:744653",
      "type": "movie",
      "name": "The Thursday Murder Club",
      "description": "A group of senior sleuths passionate about solving cold cases get plunged into a real-life murder mystery in this comic crime caper.",
      "poster": "https://image.tmdb.org/t/p/w500/jbnazCHr8S2l2glyvjPTpa4NbEw.jpg",
      "releaseInfo": "2025-08-28"
    },
    {
      "id": "tmdb:1495712",
      "type": "movie",
      "name": "Montana Mavericks",
      "description": "Heather is a New York City girl and a best-selling author on a mission to conquer writer’s block and avoid paying back an advance on her next book. Her plans take a sudden swerve when she inherits a family ranch in Montana. With her two best friends, Heather heads out for a “Yellowstone” adventure intent on a quick sale but is blindsided by both the ranch’s dilapidated condition and by Cliff, the charming cowboy veterinarian next door who challenges her big-city ideals. Heather and her friends find more than they bargained for in this big sky adventure.",
      "poster": "https://image.tmdb.org/t/p/w500/hPqoEKCSlImD2JIBf6uWMsU3Gag.jpg",
      "releaseInfo": "2025-08-26"
    },
    {
      "id": "tmdb:1532795",
      "type": "movie",
      "name": "Kill Tony: Mayhem at Madison Square Garden",
      "description": "With one minute to impress Tony Hinchcliffe and his star-studded panel, newbie stand-ups risk it all on the hallowed ground of Madison Square Garden.",
      "poster": "https://image.tmdb.org/t/p/w500/cvNM3CoKnXdY8oAmyAHTPOu17aC.jpg",
      "releaseInfo": "2025-08-25"
    },
    {
      "id": "tmdb:1515395",
      "type": "movie",
      "name": "Lego Disney Princess: Villains Unite",
      "description": "After Ariel, Moana, Tiana, Rapunzel, and Snow White thwarted Gaston's plan to take over all of their kingdoms, he calls upon Ursula, Jafar, and the Evil Queen to help take the Princesses down once and for all. The Princesses learn about Gaston's scheme and recruit a few friends of their own with the help of Magic Mirror: Aurora, Belle, and Cinderella! Together, the Princesses team up for an ultimate showdown of good versus evil.",
      "poster": "https://image.tmdb.org/t/p/w500/ajcRSuv1rYbrDxnlNN5xx5H44Ft.jpg",
      "releaseInfo": "2025-08-25"
    },
    {
      "id": "tmdb:1490891",
      "type": "movie",
      "name": "Double Scoop",
      "description": "Nora and James were once the dream team at a top New York ad agency, but now they're locked in a frosty competition for the sweetest client of all: a small-town dairy farm that churns out the most delectable ice cream in the country.",
      "poster": "https://image.tmdb.org/t/p/w500/4EZs82A1m7xSxClRTwI8JbezAnK.jpg",
      "releaseInfo": "2025-08-23"
    },
    {
      "id": "tmdb:1372260",
      "type": "movie",
      "name": "Your Host",
      "description": "Four friends get trapped in a sadistic game show, forced to outwit a twisted serial killer while racing against time. Every move brings them closer to freedom or a gruesome fate.",
      "poster": "https://image.tmdb.org/t/p/w500/dYFqEwKglMtIEta4u1PJNl5rZUX.jpg",
      "releaseInfo": "2025-08-22"
    },
    {
      "id": "tmdb:1374686",
      "type": "movie",
      "name": "Light of the World",
      "description": "It's 30 AD and everyone is expectantly awaiting the coming Messiah. While Jesus isn't exactly what they imagined, there is something special about this man. Soon, John, James, Andrew, Peter, and others begin to follow Jesus on an unexpected adventure. This beautifully animated story of Jesus is told through the eyes of his beloved young friend, the Apostle John.",
      "poster": "https://image.tmdb.org/t/p/w500/3vUqo90FCIHXPiXnQJEeqzg5EDV.jpg",
      "releaseInfo": "2025-08-22"
    },
    {
      "id": "tmdb:1244953",
      "type": "movie",
      "name": "Trust",
      "description": "A Hollywood starlet seeks refuge in a secluded Airbnb following a high-profile scandal, only to find herself at the mercy of hardened criminals on the hunt for a score.",
      "poster": "https://image.tmdb.org/t/p/w500/n9GS1mUAVMiC3gBn9rb8jrDoK4D.jpg",
      "releaseInfo": "2025-08-22"
    },
    {
      "id": "tmdb:1202306",
      "type": "movie",
      "name": "Hell House LLC: Lineage",
      "description": "After a near-death experience, Vanessa Shepherd faces nightmares in Abaddon. As mysterious deaths occur around her, she discovers her connection to the Abaddon Hotel, Carmichael Manor, and decades of unexplained murders.",
      "poster": "https://image.tmdb.org/t/p/w500/vFZo2cUEF16gsY5lhewOLFA7CBC.jpg",
      "releaseInfo": "2025-08-22"
    },
    {
      "id": "tmdb:1517212",
      "type": "movie",
      "name": "The Truth About Jussie Smollett?",
      "description": "The shocking true story of an allegedly fake story that some now say might just be a true story. With first-hand interviews from those at the helm, including investigating police, lawyers, journalists and Jussie himself, this compelling documentary invites the audience to decide for themselves who is telling The Truth About Jussie Smollett?",
      "poster": "https://image.tmdb.org/t/p/w500/iRR9Ri2GX3c5bikrz1Zuj4u5bkl.jpg",
      "releaseInfo": "2025-08-22"
    },
    {
      "id": "tmdb:1337562",
      "type": "movie",
      "name": "Splitsville",
      "description": "After Ashley asks for a divorce, good-natured Carey runs to his friends, Julie and Paul, for support. He’s shocked to discover that the secret to their happiness is an open marriage, that is until Carey crosses the line and throws all of their relationships into chaos.",
      "poster": "https://image.tmdb.org/t/p/w500/gxCv6kUdywxYzIXX6xYcmX5APUV.jpg",
      "releaseInfo": "2025-08-22"
    },
    {
      "id": "tmdb:1151334",
      "type": "movie",
      "name": "Eenie Meanie",
      "description": "A former teenage getaway driver gets dragged back into her unsavory past when a former employer offers her a chance to save the life of her chronically unreliable ex-boyfriend.",
      "poster": "https://image.tmdb.org/t/p/w500/12Va3oO3oYUdOd75zM57Nx1976a.jpg",
      "releaseInfo": "2025-08-22"
    },
    {
      "id": "tmdb:1149504",
      "type": "movie",
      "name": "Honey Don't!",
      "description": "Honey O'Donahue, a small-town private investigator, delves into a series of strange deaths tied to a mysterious church.",
      "poster": "https://image.tmdb.org/t/p/w500/fJm3kmd9NLZWypMas7g34oNFgbk.jpg",
      "releaseInfo": "2025-08-22"
    },
    {
      "id": "tmdb:1257009",
      "type": "movie",
      "name": "Primitive War",
      "description": "During the Vietnam War, a recon unit ventures to an isolated jungle valley to uncover the fate of a missing platoon. They soon find themselves in a fight for their lives against an unexpected enemy — prehistoric dinosaurs.",
      "poster": "https://image.tmdb.org/t/p/w500/7eKt7FpNgSGCKnwyeOnlC7usf2V.jpg",
      "releaseInfo": "2025-08-21"
    },
    {
      "id": "tmdb:1312946",
      "type": "movie",
      "name": "The Map That Leads to You",
      "description": "Heather is a young woman traveling Europe with friends before starting her perfectly planned life. A chance meeting with Jack sparks an unexpected romance that leads to deep emotional discovery. As secrets and life choices test their bond, her path changes forever.",
      "poster": "https://image.tmdb.org/t/p/w500/uwvKQIjJpC37IEsEj4ZAn1ITyRy.jpg",
      "releaseInfo": "2025-08-20"
    },
    {
      "id": "tmdb:787747",
      "type": "movie",
      "name": "Shell",
      "description": "Desperate to reclaim her career, once-beloved actress Samantha Lake is drawn into the glamorous world of wellness mogul Zoe Shannon -only to uncover a monstrous truth beneath its flawless surface.",
      "poster": "https://image.tmdb.org/t/p/w500/2XBNS8DxMFP7qOoTOY7cc8OYFwI.jpg",
      "releaseInfo": "2025-08-17"
    },
    {
      "id": "tmdb:1531747",
      "type": "movie",
      "name": "The Serial Killer's Apprentice",
      "description": "Dr. Katherine Ramsland interviews Elmer Wayne Henley, the sole survivor of the 1973 Houston Mass Murders, to unravel his chilling journey from manipulated teen to convicted killer — and the terrifying truth behind the line between victim and predator.",
      "poster": "https://image.tmdb.org/t/p/w500/dKdR8jQ7co3jR34hx3EoCyZ787J.jpg",
      "releaseInfo": "2025-08-17"
    },
    {
      "id": "tmdb:1458454",
      "type": "movie",
      "name": "Mystery Island: Play for Keeps",
      "description": "Mystery Island hosts a corporate retreat with a guest being Emilia's ex-fiancé. Old feelings become complicated, tensions run high, and allegations arise when a guest is found dead.",
      "poster": "https://image.tmdb.org/t/p/w500/1v07Z6n0EBhYYvvKyDQXN5hRGJE.jpg",
      "releaseInfo": "2025-08-17"
    },
    {
      "id": "tmdb:1254624",
      "type": "movie",
      "name": "Night Always Comes",
      "description": "Facing eviction in a city her family can no longer afford, a woman plunges into a desperate and increasingly dangerous all-night search to raise $25,000.",
      "poster": "https://image.tmdb.org/t/p/w500/1jDo1nG7rtjaaQGpr6e73x9i9Xp.jpg",
      "releaseInfo": "2025-08-15"
    },
    {
      "id": "tmdb:1107325",
      "type": "movie",
      "name": "Witchboard",
      "description": "A cursed Witchboard awakens dark forces, dragging a young couple into a deadly game of possession, deception, and supernatural terror in New Orleans.",
      "poster": "https://image.tmdb.org/t/p/w500/8RcN5FHkJVNJdOaL6WtTePU7CyF.jpg",
      "releaseInfo": "2025-08-15"
    },
    {
      "id": "tmdb:1511556",
      "type": "movie",
      "name": "Under Fire",
      "description": "Story unfolds in the scorching heat of the Mexico border, where rival drug dealers Griff and Abbott arrive at a remote drop point for a routine drug deal. But when the exchange goes down, both reveal undercover badges — Griff is FBI, Abbott is DEA — and neither knew they were working the same case.",
      "poster": "https://image.tmdb.org/t/p/w500/3lEtjyUd3q7vPqpgEbcS9GT7HGm.jpg",
      "releaseInfo": "2025-08-15"
    },
    {
      "id": "tmdb:1484453",
      "type": "movie",
      "name": "Snoopy Presents: A Summer Musical",
      "description": "Music and glee fill the air as Charlie Brown and the gang head off to summer camp. First-timer Sally doesn't get what all the hype is about. But when the camp may be forced to close, they team up to save it so more kids can make their own special memories.",
      "poster": "https://image.tmdb.org/t/p/w500/kK1ugxST3tCJZjZEO37sLb4Yot5.jpg",
      "releaseInfo": "2025-08-14"
    },
    {
      "id": "tmdb:1529346",
      "type": "movie",
      "name": "Krypto Saves the Day!: School Bus Scuffle",
      "description": "Krypto embarks on a high-flying chase that creates major mayhem for a bus driver on his way to school",
      "poster": "https://image.tmdb.org/t/p/w500/giRBhQ8WSDdXR3WdcwzjAq6VYGJ.jpg",
      "releaseInfo": "2025-08-13"
    },
    {
      "id": "tmdb:1504382",
      "type": "movie",
      "name": "Sweet Revenge",
      "description": "A group of friends staying at the Cabins at Crystal Lake find themselves stalked by a masked killer.",
      "poster": "https://image.tmdb.org/t/p/w500/us8m2EhaFBbqGnSAOZvfwQM0EtH.jpg",
      "releaseInfo": "2025-08-13"
    },
    {
      "id": "tmdb:537921",
      "type": "movie",
      "name": "Fixed",
      "description": "After learning he's getting neutered, a dog has 24 hours to squeeze in one last balls-to-the-wall adventure with the boys.",
      "poster": "https://image.tmdb.org/t/p/w500/udtlwWSJ45S0uQm29BvFvjPJGW0.jpg",
      "releaseInfo": "2025-08-13"
    },
    {
      "id": "tmdb:13494",
      "type": "movie",
      "name": "Red Sonja",
      "description": "A young girl rises from the ashes of tragedy to become the most feared warrior woman of all time: the She-Devil with a Sword.",
      "poster": "https://image.tmdb.org/t/p/w500/aE3yh4y0h96CZZpLo0UDFMWZAA9.jpg",
      "releaseInfo": "2025-08-13"
    },
    {
      "id": "tmdb:1512581",
      "type": "movie",
      "name": "No Tears in Hell",
      "description": "In the frozen darkness of an Alaskan winter, a mother and son turn their home into a house of nightmares — luring victims into a twisted web of abuse and cannibalism. Based on the terrifying true story of Russian serial killer Alexander Spesivtsev.",
      "poster": "https://image.tmdb.org/t/p/w500/a0bODl3Ieix1qcGRLIx6PZvluzB.jpg",
      "releaseInfo": "2025-08-12"
    },
    {
      "id": "tmdb:1517042",
      "type": "movie",
      "name": "Jim Jefferies: Two Limb Policy",
      "description": "Comedian Jim Jefferies unleashes his thoughts on tiny mustaches, straight-guy struggles and why acting doesn't count as a real job.",
      "poster": "https://image.tmdb.org/t/p/w500/fTtQ0Garm1BcexZIxfEdWdzE5j8.jpg",
      "releaseInfo": "2025-08-12"
    },
    {
      "id": "tmdb:1242434",
      "type": "movie",
      "name": "Highest 2 Lowest",
      "description": "When a titan music mogul, widely known as having the \"best ears in the business\", is targeted with a ransom plot, he is jammed up in a life-or-death moral dilemma.",
      "poster": "https://image.tmdb.org/t/p/w500/kOzwIr0R7WhaFgoYUZFLPZA2RBZ.jpg",
      "releaseInfo": "2025-08-11"
    },
    {
      "id": "tmdb:1007734",
      "type": "movie",
      "name": "Nobody 2",
      "description": "Former assassin Hutch Mansell takes his family on a nostalgic vacation to a small-town theme park, only to be pulled back into violence when they clash with a corrupt operator, a crooked sheriff, and a ruthless crime boss.",
      "poster": "https://image.tmdb.org/t/p/w500/iyxwxDZCpIm0vIORaHpmgJv2BGF.jpg",
      "releaseInfo": "2025-08-11"
    },
    {
      "id": "tmdb:1514364",
      "type": "movie",
      "name": "Kill Me Again",
      "description": "Charlie, a notorious serial killer known as the Midnight Mangler finds himself trapped, reliving the same violent night over and over. Initially embracing his grisly urges, Charlie soon becomes desperate to escape the endless nightmare.",
      "poster": "https://image.tmdb.org/t/p/w500/tPUC1q4zfxxoAPvz9ssF5QQ0sYk.jpg",
      "releaseInfo": "2025-08-08"
    },
    {
      "id": "tmdb:1319895",
      "type": "movie",
      "name": "Hostile Takeover",
      "description": "Follows Pete, a professional hitman, as he faces a group of assassins after the boss of a crime syndicate suspects disloyalty due to his attendance at Workaholics Anonymous meetings.",
      "poster": "https://image.tmdb.org/t/p/w500/vntwlS3CAKfoLTs90GaoK6lymBC.jpg",
      "releaseInfo": "2025-08-08"
    },
    {
      "id": "tmdb:1236204",
      "type": "movie",
      "name": "Birthrite",
      "description": "When a pregnant woman is bequeathed a home from an estranged aunt, she and her girlfriend leave the city behind to begin new chapter. But when a karmic debt threatens the life of their unborn child, they soon discover their place in the cursed history of the town.",
      "poster": "https://image.tmdb.org/t/p/w500/4ozeV62H7CGWprsCrif2lax8dHO.jpg",
      "releaseInfo": "2025-08-08"
    },
    {
      "id": "tmdb:1188423",
      "type": "movie",
      "name": "Site",
      "description": "After a terrifying encounter at an abandoned government test site, a small town family man begins seeing haunting visions of a past that threatens to destroy his present.",
      "poster": "https://image.tmdb.org/t/p/w500/ynfYUQ2qIFtE2sd7YiN1XzaKOjt.jpg",
      "releaseInfo": "2025-08-08"
    },
    {
      "id": "tmdb:1031962",
      "type": "movie",
      "name": "What We Hide",
      "description": "After their mother suffers a fatal overdose, two sisters fear being separated by the foster system and decide to hide her body. But when their lie risks being exposed, they must decide how far they’re willing to go to keep their secret.",
      "poster": "https://image.tmdb.org/t/p/w500/cQDHU06FsBqNv0r3n3Il3q8jPxY.jpg",
      "releaseInfo": "2025-08-08"
    },
    {
      "id": "tmdb:985602",
      "type": "movie",
      "name": "My Mother's Wedding",
      "description": "Three sisters return to their home for the third wedding of their twice-widowed mother. But the mother and daughters are forced to revisit the past and confront the future, with help from a colorful group of unexpected wedding guests.",
      "poster": "https://image.tmdb.org/t/p/w500/feHTwv3BplNlLW3o9LtW2kqZLJg.jpg",
      "releaseInfo": "2025-08-08"
    },
    {
      "id": "tmdb:1513598",
      "type": "movie",
      "name": "Stolen: Heist of the Century",
      "description": "Antwerp, 2003. A gang of thieves rob the impenetrable Diamond Center. Who was behind one of the world's biggest heists - and how did they pull it off?",
      "poster": "https://image.tmdb.org/t/p/w500/aqZOJkBd3DR6ioacm136lP7BGvi.jpg",
      "releaseInfo": "2025-08-08"
    },
    {
      "id": "tmdb:1280444",
      "type": "movie",
      "name": "The Occupant",
      "description": "Desperate to save her sister, Abby takes a dangerous job in the remote Georgian wilderness. Stranded in the mountains after her helicopter crashes, she finds hope through John, a mysterious helper radioing from nearby. As he guides her through the harsh conditions, Abby struggles to survive, and her grip on reality falters until she is faced with an impossible choice.",
      "poster": "https://image.tmdb.org/t/p/w500/aRWeT2UIkaWolqQ6fYeHOB1D6vA.jpg",
      "releaseInfo": "2025-08-08"
    },
    {
      "id": "tmdb:1125257",
      "type": "movie",
      "name": "Freakier Friday",
      "description": "Years after Tess and Anna endured an identity crisis, Anna now has a daughter of her own and a soon-to-be stepdaughter. As they navigate the myriad challenges that come when two families merge, Tess and Anna discover lightning might indeed strike twice.",
      "poster": "https://image.tmdb.org/t/p/w500/9wV65OmsjLAqBfDnYTkMPutXH8j.jpg",
      "releaseInfo": "2025-08-08"
    },
    {
      "id": "tmdb:1502943",
      "type": "movie",
      "name": "Night of the Reaper",
      "description": "College student Deena visits her hometown and is roped into a babysitting gig. Meanwhile, the local sheriff, after receiving a piece of evidence in the mail, falls into an increasingly desperate scavenger hunt involving a series of murders.",
      "poster": "https://image.tmdb.org/t/p/w500/HVR8cNWzBVoqbEIIqVtLpDvVKn.jpg",
      "releaseInfo": "2025-08-07"
    },
    {
      "id": "tmdb:1244999",
      "type": "movie",
      "name": "Stans",
      "description": "A revealing, edgy, and disarmingly personal journey into the world of superfandom, told through the lens of one of the world's most iconic and enduring artists, Eminem, and the fans that worship him.",
      "poster": "https://image.tmdb.org/t/p/w500/jqIvV9wWIA5h1UREfCcnBBlcr6Q.jpg",
      "releaseInfo": "2025-08-07"
    },
    {
      "id": "tmdb:1531940",
      "type": "movie",
      "name": "Dark Cuts: A Thriller Anthology",
      "description": "A pulse-pounding collection of five short films, each delivering a unique slice of suspense, obsession, and psychological terror-where every decision could be your last.",
      "poster": "https://image.tmdb.org/t/p/w500/vv8KtiBY59rQ5QiDGJVDSYQ2oOl.jpg",
      "releaseInfo": "2025-08-06"
    },
    {
      "id": "tmdb:1319969",
      "type": "movie",
      "name": "Sketch",
      "description": "When a young girl’s sketchbook falls into a strange pond, her drawings come to life—chaotic, real, and on the loose. As the town descends into chaos, her family must reunite and stop the monsters they never meant to unleash.",
      "poster": "https://image.tmdb.org/t/p/w500/sxiDj3dTgZuCPkx30Jvyq8K9QUV.jpg",
      "releaseInfo": "2025-08-06"
    },
    {
      "id": "tmdb:1507450",
      "type": "movie",
      "name": "If I Run",
      "description": "Casey Cox is a woman on the run after discovering her best friend Brent has been murdered—and she is being framed for it. Not knowing who to trust, Casey flees, using her intelligence and resourcefulness to stay hidden and the signs of divine guidance to help her in her journey. Meanwhile, Dylan Roberts, a war-weary veteran and private investigator with PTSD, is hired to track her down. As Dylan digs deeper into the case, he begins to suspect that Casey might actually be innocent and that the real story is far more complex—and dangerous—than it first appeared.",
      "poster": "https://image.tmdb.org/t/p/w500/k94kVhGoRJ1dSEzU5Gtj2qaZ539.jpg",
      "releaseInfo": "2025-08-02"
    },
    {
      "id": "tmdb:1018852",
      "type": "movie",
      "name": "Queen of Bones",
      "description": "Twin siblings seek answers about their mother's death and her connection to the supernatural while living on a remote homestead with their father in 1931 Oregon.",
      "poster": "https://image.tmdb.org/t/p/w500/qJSSytlQAQuyXdQwZdaNNE5WAu1.jpg",
      "releaseInfo": "2025-08-01"
    },
    {
      "id": "tmdb:1503451",
      "type": "movie",
      "name": "Marc Maron: Panicked",
      "description": "Comedian and podcaster Marc Maron offers up his nuanced perspective on our increasingly uncertain world.",
      "poster": "https://image.tmdb.org/t/p/w500/lcJ3kraMdBjjTBZgAlM2f5V5Zep.jpg",
      "releaseInfo": "2025-08-01"
    },
    {
      "id": "tmdb:1307078",
      "type": "movie",
      "name": "My Oxford Year",
      "description": "An ambitious American fulfilling her dream of studying at Oxford falls for a charming Brit hiding a secret that may upend her perfectly planned life.",
      "poster": "https://image.tmdb.org/t/p/w500/jrhXbIOFingzdLjkccjg9vZnqIp.jpg",
      "releaseInfo": "2025-08-01"
    },
    {
      "id": "tmdb:1196573",
      "type": "movie",
      "name": "She Rides Shotgun",
      "description": "Newly released from prison and marked for death by unrelenting enemies, Nate must now protect his estranged 11-year-old daughter, Polly, at all costs. With scant resources and no one to trust, Nate and Polly forge a bond under fire as he shows her how to fight and survive—and she teaches him the true meaning of unconditional love.",
      "poster": "https://image.tmdb.org/t/p/w500/nvqW8mOm818QDio3GKKmPLK8kXj.jpg",
      "releaseInfo": "2025-08-01"
    },
    {
      "id": "tmdb:1035259",
      "type": "movie",
      "name": "The Naked Gun",
      "description": "Only one man has the particular set of skills... to lead Police Squad and save the world: Lt. Frank Drebin Jr. Following in his father's footsteps, he must solve a murder case to prevent Police Squad from closure.",
      "poster": "https://image.tmdb.org/t/p/w500/rmwQ8GsdQ1M3LtemNWLErle2nBU.jpg",
      "releaseInfo": "2025-08-01"
    },
    {
      "id": "tmdb:1078605",
      "type": "movie",
      "name": "Weapons",
      "description": "When all but one child from the same class mysteriously vanish on the same night at exactly the same time, a community is left questioning who or what is behind their disappearance.",
      "poster": "https://image.tmdb.org/t/p/w500/cpf7vsRZ0MYRQcnLWteD5jK9ymT.jpg",
      "releaseInfo": "2025-07-31"
    },
    {
      "id": "tmdb:755898",
      "type": "movie",
      "name": "War of the Worlds",
      "description": "Will Radford is a top analyst for Homeland Security who tracks potential threats through a mass surveillance program, until one day an attack by an unknown entity leads him to question whether the government is hiding something from him... and from the rest of the world.",
      "poster": "https://image.tmdb.org/t/p/w500/yvirUYrva23IudARHn3mMGVxWqM.jpg",
      "releaseInfo": "2025-07-30"
    },
    {
      "id": "tmdb:1507191",
      "type": "movie",
      "name": "Dusty Slay: Wet Heat",
      "description": "Known for his laid-back Southern charm and razor-sharp wit, Slay is back following his successful 2024 debut Workin’ Man. If you love storytelling with a hilarious twist and a splash of retro flair, this one’s a must-watch.",
      "poster": "https://image.tmdb.org/t/p/w500/gACUiVRnVjjDBFfd9TtzaPVdLCe.jpg",
      "releaseInfo": "2025-07-29"
    },
    {
      "id": "tmdb:1106289",
      "type": "movie",
      "name": "The Pickup",
      "description": "A routine cash pickup takes a wild turn when mismatched armored truck drivers Russell and Travis are ambushed by ruthless criminals led by savvy mastermind Zoe.",
      "poster": "https://image.tmdb.org/t/p/w500/vFWvWhfAvij8UIngg2Vf6JV95Cr.jpg",
      "releaseInfo": "2025-07-27"
    },
    {
      "id": "tmdb:1507440",
      "type": "movie",
      "name": "Before Your Father Finds Us",
      "description": "Sophia and baby daughter, Emily, are forced to go into witness protection after she has to testify against her ex-husband Mason for his crimes. After years of living a seemingly normal life with new friends and relationships, Sophia learns that Mason has escaped from his maximum security prison. Knowing his strength and connections, Sophia is forced to reveal the truth to her now teenage daughter about who her father really is – and having to leave everything behind. Escaping to an old remote cabin in the woods together, Sophia and Emily must do everything it takes to survive Mason and his ruthless intent to make the family whole again.",
      "poster": "https://image.tmdb.org/t/p/w500/hS3jhoam6XL3bTD9Mwrz6UOFLCl.jpg",
      "releaseInfo": "2025-07-26"
    },
    {
      "id": "tmdb:1362514",
      "type": "movie",
      "name": "House on Eden",
      "description": "Paranormal investigators Kris, Celina and their videographer Jay are rerouted to an abandoned house deep in the woods, where they find themselves facing a force unlike anything they've encountered before. As the night spirals into chaos, missing crew members and eerie phenomena hint at an ancient, malevolent presence watching their every move.",
      "poster": "https://image.tmdb.org/t/p/w500/2xVyCvnuVVRpYohPxrvwxZiH49r.jpg",
      "releaseInfo": "2025-07-25"
    },
    {
      "id": "tmdb:1241470",
      "type": "movie",
      "name": "Osiris",
      "description": "Special Forces commandos on a mission are abducted mid-operation by a mysterious spacecraft. Upon waking aboard, they find themselves prey to a relentless alien race in a fight for survival.",
      "poster": "https://image.tmdb.org/t/p/w500/3YtZHtXPNG5AleisgEatEfZOT2w.jpg",
      "releaseInfo": "2025-07-25"
    },
    {
      "id": "tmdb:926606",
      "type": "movie",
      "name": "The Home",
      "description": "A troubled man starts working at a retirement home and realizes its residents and caretakers harbor sinister secrets. As he investigates the building and its forbidden fourth floor, he starts to uncover connections to his own past and upbringing as a foster child.",
      "poster": "https://image.tmdb.org/t/p/w500/r0NUt1M62StNgvSLmLsmJADbHpg.jpg",
      "releaseInfo": "2025-07-25"
    },
    {
      "id": "tmdb:1049942",
      "type": "movie",
      "name": "Bambi: The Reckoning",
      "description": "After a mother and son get in a car wreck, they soon become hunted by Bambi, a mutated grief-stricken deer on a deadly rampage seeking revenge for the death of his mother and wife.",
      "poster": "https://image.tmdb.org/t/p/w500/8oBbWxWDJrrDtNkmd0OzZpPFFUR.jpg",
      "releaseInfo": "2025-07-25"
    },
    {
      "id": "tmdb:1175942",
      "type": "movie",
      "name": "The Bad Guys 2",
      "description": "The now-reformed Bad Guys are trying (very, very hard) to be good, but instead find themselves hijacked into a high-stakes, globe-trotting heist, masterminded by a new team of criminals they never saw coming: The Bad Girls.",
      "poster": "https://image.tmdb.org/t/p/w500/c1msaKf1wyuKcmLjjJd6rIBPFcd.jpg",
      "releaseInfo": "2025-07-23"
    },
    {
      "id": "tmdb:1530282",
      "type": "movie",
      "name": "Girl in the Cellar",
      "description": "A mother imprisons her daughter in their basement to prevent bad choices, unaware she's recreating her own traumatic past. As neighbors notice the girl's absence, suspicion falls on the conflicted mother.",
      "poster": "https://image.tmdb.org/t/p/w500/b6ftf7urcngXPDK4i8wfzhLSqsG.jpg",
      "releaseInfo": "2025-07-23"
    },
    {
      "id": "tmdb:1358210",
      "type": "movie",
      "name": "Bait",
      "description": "On their way to a family get-together, the Herring family are in a bad car accident, waking in a terrifying, dark basement. Something is there with them. Caged. And it craves human flesh. With a mysterious overseer aiding the creature like a pet, the family must work together to find a way to defeat them both and make their escape.",
      "poster": "https://image.tmdb.org/t/p/w500/rgvYPByEcOBAP3PLIFATQ3ApvaM.jpg",
      "releaseInfo": "2025-07-22"
    },
    {
      "id": "tmdb:1484267",
      "type": "movie",
      "name": "Trainwreck: P.I. Moms",
      "description": "This tell-all documentary investigates an early 2000s reality show about private eye moms and the drug scandal that sabotaged the series and its stars.",
      "poster": "https://image.tmdb.org/t/p/w500/gACBkTDNDP2GGspeFkn7AhCpiL3.jpg",
      "releaseInfo": "2025-07-22"
    },
    {
      "id": "tmdb:1263256",
      "type": "movie",
      "name": "Happy Gilmore 2",
      "description": "Happy Gilmore isn't done with golf — not by a long shot. Since his retirement after his first Tour Championship win, Gilmore returns to finance his daughter's ballet classes.",
      "poster": "https://image.tmdb.org/t/p/w500/nRwDPfYUzzzUQarfMxvPlasxzpL.jpg",
      "releaseInfo": "2025-07-21"
    },
    {
      "id": "tmdb:617126",
      "type": "movie",
      "name": "The Fantastic 4: First Steps",
      "description": "Against the vibrant backdrop of a 1960s-inspired, retro-futuristic world, Marvel's First Family is forced to balance their roles as heroes with the strength of their family bond, while defending Earth from a ravenous space god called Galactus and his enigmatic Herald, Silver Surfer.",
      "poster": "https://image.tmdb.org/t/p/w500/abqOz6EL3yXyOOafCPZxjL1M5bQ.jpg",
      "releaseInfo": "2025-07-21"
    },
    {
      "id": "tmdb:1507445",
      "type": "movie",
      "name": "Faith in the Flames: The Nichole Jolly Story",
      "description": "Nichole Jolly is a nurse at the town’s hospital, who begins her day as usual, only to face an unimaginable crisis when a wildfire rapidly engulfs the town. Torn between her duty to protect her patients and her desperate need to find her husband Nick, (Colin Moss) and children, Nichole discovers an unyielding strength within herself to save not only her family but countless residents from the encroaching flames. The film is a tribute to the indomitable human spirit and the unsung heroes who emerge in the face of tragedy.",
      "poster": "https://image.tmdb.org/t/p/w500/p8hTeG5nevWI8eOnnn1sSXtvt8v.jpg",
      "releaseInfo": "2025-07-19"
    },
    {
      "id": "tmdb:1495506",
      "type": "movie",
      "name": "SpongeBob SquarePants: Order Up",
      "description": "During one of his shifts at the Krusty Krab, SpongeBob amuses himself by overusing the restaurant's order up bell, much to the dismay of his grumpy co-worker and neighbor, Squidward.",
      "poster": "https://image.tmdb.org/t/p/w500/wR5tkXHpcJLGQA9HKDZcUMpxU50.jpg",
      "releaseInfo": "2025-07-18"
    },
    {
      "id": "tmdb:1495110",
      "type": "movie",
      "name": "Vir Das: Fool Volume",
      "description": "Whether it's the police, the evil eye or a badly timed lost voice, comedian Vir Das explores how embracing foolishness has led him to shared happiness, in his fifth comedy special (sixth, if you know you know)—shot by an all-Indian crew across cities in three continents: London, New York, and Mumbai.",
      "poster": "https://image.tmdb.org/t/p/w500/druY5vhbnJSbFeq3V0AfDHYfXfe.jpg",
      "releaseInfo": "2025-07-18"
    },
    {
      "id": "tmdb:1026222",
      "type": "movie",
      "name": "Saint Clare",
      "description": "In a small town a solitary woman is haunted by voices that lead her to assassinate ill intended people and get away with it, until her last kill sucks her down a rabbit hole riddled with corruption, trafficking and visions from the beyond.",
      "poster": "https://image.tmdb.org/t/p/w500/aE0q4awk7zto3Eql4cAeJuVAns9.jpg",
      "releaseInfo": "2025-07-18"
    },
    {
      "id": "tmdb:1083433",
      "type": "movie",
      "name": "I Know What You Did Last Summer",
      "description": "When five friends inadvertently cause a deadly car accident, they cover up their involvement and make a pact to keep it a secret rather than face the consequences. A year later, their past comes back to haunt them and they're forced to confront a horrifying truth: someone knows what they did last summer…and is hell-bent on revenge.",
      "poster": "https://image.tmdb.org/t/p/w500/8FP2ObEGIiQYQCf83gL4ZVzwZF8.jpg",
      "releaseInfo": "2025-07-15"
    },
    {
      "id": "tmdb:1477566",
      "type": "movie",
      "name": "Trainwreck: Balloon Boy",
      "description": "A homemade flying saucer lifts off, and a 6-year-old boy might be inside. National panic ensues — but what truly happened? This documentary investigates.",
      "poster": "https://image.tmdb.org/t/p/w500/4QpWZlGZMYrAnlQizjVIMnAXnv0.jpg",
      "releaseInfo": "2025-07-15"
    },
    {
      "id": "tmdb:1073109",
      "type": "movie",
      "name": "Push",
      "description": "A pregnant realtor must survive a night of terror when a deranged client shows up at her open house.",
      "poster": "https://image.tmdb.org/t/p/w500/7iFScmZOT5ViMMSVErO1cyE0IOA.jpg",
      "releaseInfo": "2025-07-11"
    },
    {
      "id": "tmdb:728623",
      "type": "movie",
      "name": "Don't Log Off",
      "description": "When Sam vanishes mid-video call, her friends race to uncover what happened. As they dig online, they vanish one by one. A sinister force is at play - can they solve the mystery before they're next?",
      "poster": "https://image.tmdb.org/t/p/w500/fi5iVxEYzQsHT3t58DwffEpiMfB.jpg",
      "releaseInfo": "2025-07-11"
    },
    {
      "id": "tmdb:420074",
      "type": "movie",
      "name": "Shark Terror",
      "description": "After falling overboard during a cruise, a young woman washes ashore – injured, stranded, and stalked by sharks – as her desperate mother races to find her.",
      "poster": "https://image.tmdb.org/t/p/w500/hPRoBl2iaE2RIIFkUfwgXWSuBy9.jpg",
      "releaseInfo": "2025-07-11"
    },
    {
      "id": "tmdb:1246310",
      "type": "movie",
      "name": "Madea's Destination Wedding",
      "description": "Madea packs her best floral dresses and a whole lot of chaos when the Simmons family heads to the Bahamas for her grandniece's whirlwind wedding.",
      "poster": "https://image.tmdb.org/t/p/w500/jwMwRucnAROgWo9WLLmIqzHmmzi.jpg",
      "releaseInfo": "2025-07-11"
    },
    {
      "id": "tmdb:648878",
      "type": "movie",
      "name": "Eddington",
      "description": "In May of 2020, a standoff between a small-town sheriff and mayor sparks a powder keg as neighbor is pitted against neighbor in Eddington, New Mexico.",
      "poster": "https://image.tmdb.org/t/p/w500/4GIqZUgPZ146BhibsPHMHef2nXX.jpg",
      "releaseInfo": "2025-07-10"
    },
    {
      "id": "tmdb:1243341",
      "type": "movie",
      "name": "Z-O-M-B-I-E-S 4: Dawn of the Vampires",
      "description": "A new adventure dawns for Zed and Addison when their summer road trip takes an unexpected detour, landing them in the middle of yet another monster rivalry: Daywalkers vs. Vampires. Tensions flare when Zed and Addison find themselves acting as camp counselors between the two opposing supernatural factions. With the help of Eliza and Willa, they must convince sworn enemies Nova and Victor to try to unite their warring worlds before an even greater threat endangers them all.",
      "poster": "https://image.tmdb.org/t/p/w500/6rGsqBxI4r1YkS9FuraovWi465w.jpg",
      "releaseInfo": "2025-07-10"
    },
    {
      "id": "tmdb:1504091",
      "type": "movie",
      "name": "Nate Jackson: Super Funny",
      "description": "Sharp jokes meet savage roasts as Nate Jackson blends his infamous crowd work with takes on topics from judgment-free gyms to catfishing.",
      "poster": "https://image.tmdb.org/t/p/w500/bO6nBUDE6ctqIMMGe5TeeJ5CxVN.jpg",
      "releaseInfo": "2025-07-08"
    },
    {
      "id": "tmdb:1499086",
      "type": "movie",
      "name": "Simple Plan: The Kids in the Crowd",
      "description": "A captivating and nostalgic look at one of the most popular pop-punk bands of the 2000s. Packed with never-before-seen archival footage and exclusive access to their sold-out 2024 World Tour, the members of Simple Plan and a cast of punk-rock superstars recount the highs and lows of the first 25 years of their career. Stage-dive into a story of brotherhood, fans and resilience.",
      "poster": "https://image.tmdb.org/t/p/w500/AgVgrIabxTBkFSfFpcfjMVcoqaG.jpg",
      "releaseInfo": "2025-07-08"
    },
    {
      "id": "tmdb:1061474",
      "type": "movie",
      "name": "Superman",
      "description": "Superman, a journalist in Metropolis, embarks on a journey to reconcile his Kryptonian heritage with his human upbringing as Clark Kent.",
      "poster": "https://image.tmdb.org/t/p/w500/ldyfo0BKmz5rWtJJKCvwaNS4cJT.jpg",
      "releaseInfo": "2025-07-07"
    },
    {
      "id": "tmdb:1504635",
      "type": "movie",
      "name": "Great White Waters",
      "description": "When millions in cartel cocaine go missing off Florida's coast, the search turns savage as vicious sharks close in on anyone daring to claim the stash.",
      "poster": "https://image.tmdb.org/t/p/w500/1sZSRb0t4zXLv0NZdkghcpShYgf.jpg",
      "releaseInfo": "2025-07-04"
    }
  ],
  "ts": 1766838820692
}